{
    "FRIEND_OFFLINE": {
        "message": "__name__ غير متصل بالإنترنت",
        "description": "Message shown when trying to get access from a friend who is offline."
    },
    "SEND_CONNECTION_LINK": {
        "message": "لمشاركة اتصالك، يُرجى أن تطلب من صديقك إرسال الوصلة الخاصة بهم لك.",
        "description": "Instructions for the user to share their connection with a one-time link."
    },
    "WELCOME": {
        "message": "مرحباً بكم في uProxy",
        "description": ""
    },
    "ONE_TIME_SHARING": {
        "message": "أنت حالياً تشارك الوصول.",
        "description": "The user is sharing their Internet access with a friend."
    },
    "REQUESTING_ACCESS_NOTIFICATION": {
        "message": "__name__ يطلب الوصول",
        "description": "Notification for when a friend sends a request to access the Internet through the user."
    },
    "CHANGE_STATS_CHOICE": {
        "message": "يمكنك تغيير اختيارك في أي وقت من قائمة الإعدادات.",
        "description": "Informs the user that they can opt in and out of sending anonymous statistics at any time they choose, from the Settings menu."
    },
    "SHARING_ACCESS_WITH_TWO": {
        "message": "مشاركة الوصول مع __name1__ و __name2__",
        "description": "Message in a status bar that is visible when two friends are getting access through the user."
    },
    "EMAIL_INSTEAD_MESSAGE": {
        "message": "نحن غير قادرين على تقديم تعليقاتك إلى uproxy. org. يرجى نسخ ولصق تعليقاتك في بريد إلكتروني إلى info@uproxy.org.",
        "description": "Seen if feedback submission through uProxy fails. Message asks users to email their feedback instead."
    },
    "WE_WONT_POST": {
        "message": "لن نشارك بياناتك أو ننشرها بشكل علني دون موافقتك",
        "description": "Inform the user that uProxy does not share data or post to their social network accounts without agreement from the user."
    },
    "IM_IN": {
        "message": "تم وصولي",
        "description": "Agree to submitting anonymous metrics to uProxy."
    },
    "STOP_ONE_TIME_INSTRUCTION": {
        "message": "للتوقف عن الوصول من خلال صديقك، انقر على الزر أدناه.",
        "description": ""
    },
    "THANK_YOU": {
        "message": "شكراً لك!",
        "description": ""
    },
    "EMAIL_INSTEAD_TITLE": {
        "message": "تعليقات البريد الإلكتروني بدلاً من ذلك؟",
        "description": "Title for error that appears if feedback submission failed."
    },
    "SELECT_LANGUAGE": {
        "message": "اختيار لغة",
        "description": "Instruction to select language used by the application."
    },
    "GET_HELP": {
        "message": "الحصول على مساعدة",
        "description": "Get help from the frequently asked questions page."
    },
    "YES": {
        "message": "نعم",
        "description": "Button label."
    },
    "SUBMIT_FEEDBACK_SENTENCE_CASE": {
        "message": "تقديم تعليقات",
        "description": "Submit feedback to the uProxy team."
    },
    "GET_ONE_TIME_INSTEAD_INSTRUCTION": {
        "message": "إذا كنت تود بدء اتصال لمرة واحدة فقط مع شخص آخر، اضغط على زر \"عودة\" ثم \"بدء اتصال لمرة واحدة\" لبدء جلسة جديدة.",
        "description": "Instructions for the user if they want to abort an existing attempt and start a new one-time connection."
    },
    "ERROR_PARSING_LINK": {
        "message": "حدث خطأ أثناء تحليل رابط اتصال uproxy، يُرجى محاولة الانتقال إلى الوصلة ثانية أو طلب وصلة جديدة من صديقك.",
        "description": "Error shown if a one-time connection link did not work."
    },
    "FEEDBACK_TITLE": {
        "message": "أدخل تعليقك أدناه",
        "description": "Label for textbox for user's to submit feedback and comments to uProxy."
    },
    "HOW_TO_OFFER_ONE_TIME": {
        "message": "إذا أرد أن تتيح لهم إمكانية الوصول، انسخ والصق هذا العنوان وأرسله لهم.",
        "description": "Instructions for user if they'd like to share their Internet connection with a one-time link."
    },
    "LOADING_FRIENDS": {
        "message": "تحميل أصدقاء uProxy",
        "description": "User's friends are being loaded from a social network."
    },
    "ACCEPT_OFFER": {
        "message": "قبول العرض",
        "description": "Accept a friend's offer that would allow the user to access the Internet through their friend."
    },
    "SHARING_ACCESS_WITH_ONE": {
        "message": "مشاركة إمكانية الوصول مع __name__",
        "description": "Message in a status bar that is visible when one friend is getting access through the user."
    },
    "STATS_ENABLED_MESSAGE": {
        "message": "تهني هذه الأيقونة أنك اخترت مشاركة إحصائيات مجهولة المصدر مع فريق uProxy. انقر لتعديل الإعدادات.",
        "description": "Text that appears in a popup explaining the 'anonymous stats enabled' icon."
    },
    "REQUESTS": {
        "message": "الطلبات",
        "description": "Title for the group of friends who have sent requests to access the user's Internet, which the user have not yet granted."
    },
    "START_GETTING": {
        "message": "بدء الحصول على وصول",
        "description": "Start accessing the Internet through a friend's connection."
    },
    "STOP_GETTING": {
        "message": "التوقف عن تحقيق وصول",
        "description": "Stop accessing the Internet through a friend's connection."
    },
    "ADVANCED_SETTINGS_SENTENCE_CASE": {
        "message": "إعدادات متقدمة",
        "description": "Title for the advanced settings screen."
    },
    "ENABLE_METRICS": {
        "message": "هل تود تمكين جمع المعايير بشكل مجهول المصدر؟",
        "description": "Asks the user if they want to send anonymous metrics about their uProxy usage."
    },
    "TRYING_TO_SHARE_ONE_TIME": {
        "message": "تقوم حالياً بمحاولة مشاركة الوصول. إذا كنت تود التمكن من الوصول بدلاً من ذلك، انقر على الوصلة أعلاه.",
        "description": "Instructions for user if they want to get access instead, while attempting to share access."
    },
    "LANGUAGE": {
        "message": "اللغة",
        "description": "Language used by the application."
    },
    "UNLIKELY": {
        "message": "غالباً لا",
        "description": "Meaning very low probability. Used in context of the probability that network settings are preventing a uProxy connection from being established. Used in analysisResults string."
    },
    "ALPHA_MESSAGE": {
        "message": "هذا إصدار المرحلة ألفا لـ uProxy. يمكنك مساعدتنا على تحسين uProxy بمشاركة معايير مجهول مع فريق التطوير. يتم جعل مصدر البيانات التي يتم الإبلاغ عنها مجهولاً ونقلها بطريقة آمنة.",
        "description": "Text in a popup that appears wen the user first uses uProxy. Explains that the current version of uProxy is an early, unfinished release, and anonymous statistics (from the user, if they choose) can help with uProxy's development."
    },
    "MORE_INFORMATION": {
        "message": "المزيد من المعلومات.",
        "description": ""
    },
    "POSSIBLY": {
        "message": "من المحتمل",
        "description": "Meaning medium probability. Used in context of the probability that network settings are preventing a uProxy connection from being established. Used in analysisResults string."
    },
    "FRIEND_REQUESTS_ACCESS": {
        "message": "__name__ يطلب تحقيق الوصول من خلالك.",
        "description": "A friend has requested to access the Internet through the user."
    },
    "GET_ONE_TIME_INSTEAD": {
        "message": "احصل على إمكانية الوصول بدلاً من ذلك",
        "description": "Label for a link to the 'Start a one-time connection' page."
    },
    "SET_UP_ONE_TIME": {
        "message": "أعد اتصالاً لمرة واحدة فقط",
        "description": "Clickable link on the login page. As an alternative to logging in to a social network, user's can attempt a connection with a one-time link."
    },
    "FRIEND_REQUESTED_ONE_TIME": {
        "message": "طلب صديقك استعمال اتصال الإنترنت الخاص بك.",
        "description": "A friend has requested to access the Internet through the user."
    },
    "NO": {
        "message": "لا",
        "description": "Button label."
    },
    "ARE_YOU_SURE": {
        "message": "هل أنت متأكد أنك تريد أن تنهي هذا الاتصال لمرة واحدة فقط؟",
        "description": "Question confirming if the user wants to end an active connection to a friend."
    },
    "ACCEPTED_OFFER_NOTIFICATION": {
        "message": "قبل __name__ عرضك للوصول",
        "description": "Notification for when a friend has accepted the user's offer to share their Internet with that friend."
    },
    "SHARING_UNAVAILABLE_TITLE": {
        "message": "المشاركة غير متوفرة",
        "description": "Title for error that appears when the user can not share their Internet access with friends."
    },
    "LEARN_MORE_UPROXY": {
        "message": "تعرف على المزيد عن uProxy",
        "description": "Label for button that brings user to more information about uProxy."
    },
    "START_ONE_TIME_INSTRUCTION": {
        "message": "لبدء تحقيق الوصول عبر صديقك، انقر على الزر أدناه.",
        "description": ""
    },
    "NO_FRIENDS_ONLINE": {
        "message": "ليس هناك أي من أصدقائك مسجل دخولهم إلى uProxy في هذا الوقت.",
        "description": "None of the user's friends are currently signed in."
    },
    "CONTINUE_BROWSING": {
        "message": "متابعة التصفح دون uProxy",
        "description": "Label for button that will change the users Internet settings back to using the user's local connection (i.e. not their friend's Internet)."
    },
    "GRANTED_ACCESS_NOTIFICATION": {
        "message": "منحك __name__ وصولاً",
        "description": "Notification for when a user's request to access the Internet through a friend has been accepted by that friend."
    },
    "EMAIL_TITLE": {
        "message": "بريد إلكتروني (اختياري)",
        "description": ""
    },
    "ASK_TO_ANALYZE": {
        "message": "قد يكون نوع NAT الخاص بشبكتك غير متوافقة مع uProxy. هل تود أن يحلل uProxy شبكتك؟",
        "description": "Text in a popup that appears when an attempt to access the Internet through a friend fails."
    },
    "SHARE_ONE_TIME": {
        "message": "شارك اتصالاً لمرة واحدة",
        "description": "Share access to the user's Internet using a link that will only work once."
    },
    "ASK_TO_SUBMIT_ANALYSIS": {
        "message": "هل تود أن تقدم نوع NAT الخاص بك إلى فريق uProxy لمساعدتنا على الوصول إلى فهم أفضل للشبكات التي يستعملها مستخدمونا؟",
        "description": "Asks the user if they are willing to share their network analysis results with uProxy, to help the development of uProxy."
    },
    "GET_ACCESS": {
        "message": "الحصول على وصول",
        "description": "Text for the tab on the toolbar. When the user is on the 'Get Access' tab, they are looking to get access to the Internet through a friend."
    },
    "RETRIEVING_LOGS": {
        "message": "استرجاع السجلات وتحليل شبكتك...",
        "description": "Message shown while uProxy is analyzing the user's network settings."
    },
    "LEARN_MORE_SOCIAL": {
        "message": "التعرف على المزيد عن الشبكات الاجتماعية",
        "description": "Label for button that brings user to more information about why social networks are used for uProxy."
    },
    "WAITING_FOR_ACCESS": {
        "message": "سيمكنك تحقيق الوصول عندما يقبل __name__.",
        "description": "User will be able to access the Internet through their friend, once that friend gives the user permission."
    },
    "CONNECTED_WITH": {
        "message": "متصل بـ __network__",
        "description": "Text in settings that informs the user which social network they're connected to."
    },
    "REQUEST_ONE_TIME": {
        "message": "طلب اتصال لمرة واحدة فقط",
        "description": "Request access to the user's friend's Internet using a link that will only work once."
    },
    "CONNECT": {
        "message": "توصيل",
        "description": "User clicks this to connect to a network"
    },
    "CLOSE": {
        "message": "إغلاق",
        "description": "Button label to close a popup."
    },
    "DEVICE_DESCRIPTION": {
        "message": "وصف الأداة",
        "description": "Title for the section in Settings where the user can edit the name of their device."
    },
    "LOGOUT": {
        "message": "تسجيل الخروج من uProxy",
        "description": "Log-out of uProxy."
    },
    "EDIT_ADVANCED_SETTINGS": {
        "message": "حرر إعداداتك أدناه",
        "description": "Instruction for the user to edit their advanced settings (by typing JSON in a textbox)."
    },
    "REVOKE_ACCESS": {
        "message": "إلغاء الوصول",
        "description": "Label for button that takes back an offer to a friend who has already accepted that offer. If the button is clicked, the friend will no longer be able to connect to the Internet through the user."
    },
    "UNABLE_TO_GET_FROM": {
        "message": "غير قادر على الوصول عبر __name__",
        "description": "Error message seen in uProxy when the user failed to get access to the Internet through a friend."
    },
    "FRIENDS_WHO_CAN_GET": {
        "message": "الأصدقاء الذين يمكنهم تحقيق الوصول من خلالك",
        "description": "Title for the group of friends who can access the Internet through the user."
    },
    "SUBMIT_FEEDBACK": {
        "message": "تقديم تعليقات",
        "description": "Submit feedback to the uProxy team."
    },
    "ASKING_FOR_ACCESS": {
        "message": "أنت حالياً تشارك الوصول.",
        "description": "The user is asking for permission to access the Internet through their friend; user is waiting for the friend's reply."
    },
    "ANALYZING_NETWORK": {
        "message": "جاري تحليل الشبكة",
        "description": "Message shown when the user's network is being analyzed."
    },
    "STOP_ONE_TIME_GETTING_BEFORE_NEW": {
        "message": "إذا أردت تحقيق اتصال لمرة واحدة فقط، اضغط \"التوقف عن الوصول\" أولاً.",
        "description": "Instruction for the user to stop a current one-time connection if they want to start a new one."
    },
    "MORE_INFO": {
        "message": "المزيد من المعلومات",
        "description": "Link to 'Does uProxy log data about me?' question in the FAQ."
    },
    "PRIVACY_POLICY": {
        "message": "سياسة الخصوصية",
        "description": "Link to uProxy's privacy policy."
    },
    "STOP_IGNORING_OFFERS": {
        "message": "إيقاف تجاهل العروض",
        "description": "Button label for if the user wants to stop ignoring offers."
    },
    "ERROR_SIGNING_IN": {
        "message": "كانت هناك مشكلة في تسجيل الدخول إلى __network__. يُرجى المحاولة ثانية.",
        "description": "Notification for when the user could not be signed in to a social network."
    },
    "UNABLE_TO_GET": {
        "message": "غير قادر على تحقيق الوصول",
        "description": "Title for popup that appears when an attempt to access the Internet through a friend fails."
    },
    "SHARING_ENABLED_MESSAGE": {
        "message": "تعني هذه الأيقونة أنك متاح لمشاركة الوصول مع الأصدقاء الذي عرضت عليهم الوصول من خلالك.",
        "description": "Text in a popup that explains what the sharing icon (on the toolbar) is."
    },
    "STOP_ONE_TIME_SHARING_BEFORE_NEW": {
        "message": "إذا كنت تود بدء اتصال جديد لمرة واحدة فقط، اضغط \"التوقف عن مشاركة الوصول\" أولاً.",
        "description": "Instruction for the user to stop a current one-time connection if they want to start a new one."
    },
    "IGNORE": {
        "message": "تجاهل",
        "description": "Button label that ignores an offer or request."
    },
    "LOGS_TITLE": {
        "message": "تحليل السجلات والشبكة",
        "description": "Title for the page that displays a user's network information and uProxy logs."
    },
    "FRIEND_REQUESTED_ACCESS": {
        "message": "لقد طلبوا تحقيق الوصول من خلالك.",
        "description": "A friend has requested to access the Internet through the user."
    },
    "GO_BACK": {
        "message": "عودة إلى السابق؟",
        "description": "Go back to the main page from the one-time connection page."
    },
    "ACCESS_NOT_GRANTED": {
        "message": "لم تمنحهم إمكانية الوصول.",
        "description": "The user has not permissioned a friend to access the Internet through the user."
    },
    "NETWORK_AND_LOGS": {
        "message": "تحليل الشبكة والسجلات",
        "description": "Label for a checkbox that indicates if the user wants uProxy to analyze their network settings and include their uProxy logs with their feedback to the uProxy team."
    },
    "WELCOME_MESSAGE": {
        "message": "للبدء، اختر \"الحصول على وصول\" أو \"مشاركة الوصول\" ثم النقر على صديق لتحقيق الإيصال.",
        "description": "Text in a popup that appears when the user first uses uProxy. Explains that the user needs to choose either the Get or Share tab appropriately."
    },
    "NO_THANKS": {
        "message": "لا شكراً",
        "description": "Do not agree to submitting anonymous metrics to uProxy."
    },
    "FRIENDS_WHO_SHARE": {
        "message": "الأصدقاء الذين يمكننك الوصول من خلالهم",
        "description": "Title for the group of friends who the user can get Internet access from."
    },
    "UNABLE_TO_SHARE_WITH": {
        "message": "غير قادر على مشاركة الوصول مع __name__",
        "description": "Error message seen in uProxy when a friend failed to get access to the Internet through the user."
    },
    "SETTINGS_JSON_ERROR": {
        "message": "لم يمكن الإعداد: رقم JSON غير متوافق",
        "description": "Error shown to the user if their input for advanced settings is incomplete or incompatible with expected settings configurations."
    },
    "OFFER_ACCESS": {
        "message": "عرض الوصول",
        "description": "Label for button that will offer a friend access to the Internet through the user, even though the friend has not requested access."
    },
    "NEXT": {
        "message": "التالي",
        "description": "Label for button that proceeds from the introduction page to the login page."
    },
    "SHARING_UNAVAILABLE_MESSAGE": {
        "message": "أنت تستعمل Firefox 37 الذي يعاني من علة تحول دون عمل خيار المشاركة (انظر git.io /vf 5 x 1 ). هذه العلة تم إصلاحها في Firefox 38، لذا يمكنك تمكين المشاركة بترقية متصفح Firefox أو التحول إلى Chrome.",
        "description": "Text for error that appears when the user can not share their Internet access with friends."
    },
    "ANALYSIS_RESULTS": {
        "message": "يبدو أنك متصل بشبكة من نوع a __natType__ وهي __natImpact__ وتتداخل مع قدرتك على الاتصال بأصدقائك.",
        "description": "A summary of the user's network analysis."
    },
    "SHARING_ENABLED_TITLE": {
        "message": "إعدادات متقدمة",
        "description": "Title for popup that points to the sharing icon in uProxy's top toolbar. The popup appears when the user first grants access to one of their friends. The sharing icon is visible as long as there are friends who can get access to the user's Internet."
    },
    "START_NEW_CONNECTION": {
        "message": "البدء في الحصول على اتصال جديد",
        "description": "Label for button that takes user back to the 'Start a one-time connection' page."
    },
    "APP_MISSING_TITLE": {
        "message": "أنت على وشك أن تكون مستعداً لاستعمال uProxy!",
        "description": "Shown in Chrome if the user has not finished installing both parts of uProxy."
    },
    "CANCEL_REQUEST": {
        "message": "إلغاء الطلب",
        "description": "Label for button which will take back a request to get Internet access through a friend."
    },
    "SHARING_ACCESS_WITH_MANY": {
        "message": "مشاركة الوصول مع __name__ و__numOthers__ آخرين",
        "description": "Message in a status bar that is visible when three or more friends are getting access through the user."
    },
    "CANNOT_OPEN_ONE_TIME_TITLE": {
        "message": "ليس بالإمكان فتح اتصال لمرة واحدة",
        "description": "Title for an error popup that appears if the user tries to open a one-time link while signed in to a social network."
    },
    "LOGGED_OUT": {
        "message": "تم تسجيل خروجك من __network__ ",
        "description": "Notification for when the user has been logged out of the social network."
    },
    "RESTART": {
        "message": "إعادة تشغيل",
        "description": "Restart uProxy completely."
    },
    "START_ONE_TIME": {
        "message": "بدء اتصال لمرة واحدة فقط",
        "description": "Start an Internet connection using a link that will only work once."
    },
    "STOPPED_PROXYING": {
        "message": "توقف __name__ عن الاتصال بالإنترنت بالوكالة من خلالك ",
        "description": "Notification for when a friend has stopped accessing the Internet through the user."
    },
    "DISCONNECTED_TITLE": {
        "message": "قُطع اتصالك بصديقك.",
        "description": "Title for error that appears when the user was getting access to the Internet through their friend, but that connection was terminated."
    },
    "CONNECTED_WITH_NUMBER": {
        "message": "ارتباط بـ __number__ شبكة",
        "description": "Text in settings informing the user of how many networks they're connected to."
    },
    "ATTEMPTING_RECONNECT": {
        "message": "جاري محاولة إعادة الاتصال",
        "description": "uProxy was disconnected from the social network and is trying to reconnect."
    },
    "WHICH_SOCIAL_NETWORK": {
        "message": "أين يمكن العثور أسماء المتصلين بأسرع ما يمكن؟",
        "description": "Question seen at the top of uProxy's login page. Asks which social network should be used to find the user's friends."
    },
    "TRYING_TO_CONNECT": {
        "message": "جاري محاولة الاتصال بـ __name__",
        "description": "The user is trying to connect to the Internet through their friend."
    },
    "EMAIL_PLACEHOLDER": {
        "message": "عنوان البريد الإلكتروني",
        "description": ""
    },
    "SAVE": {
        "message": "حفظ",
        "description": "Label for button that saves the user's text input."
    },
    "OFFERED_YOU_ACCESS": {
        "message": "لد عرضوا عليك إمكانية الوصول.",
        "description": "A friend has offered their Internet access to the user."
    },
    "SHARING_ENABLED_TOOLTIP": {
        "message": "أنت متاح للمشاركة.",
        "description": "Text that appears in a tooltip when the user hovers over the sharing icon."
    },
    "SHARE_ACCESS": {
        "message": "مشاركة الوصول",
        "description": "Text for the tab on the toolbar. When the user is on the 'Share Access' tab, they are looking to share access to their Internet with a friend."
    },
    "DISCONNECT": {
        "message": "فصل الاتصال",
        "description": "User clicks this to disconnect from a network"
    },
    "UNABLE_TO_SHARE": {
        "message": "غير قادر على مشاركة الوصول",
        "description": "Title for popup that appears when an attempt to share the Internet with a friend fails."
    },
    "DISCONNECTED_MESSAGE": {
        "message": "يُرجى التقدم بحذر. لن يتم تمرير حركتك على الإنترنت من خلال صديقك بعد الآن. قد تود إغلاق أي نوافذ حساسة قد تكون مفتوحة لديك قبل المواصلة.",
        "description": "Instruction informing the user that to continue browsing the Internet, the user will need to use their local (potentially unsafe and/or censored) connection."
    },
    "WHY_SOCIAL_NETWORK": {
        "message": "يستعمل uProxy شبكات اجتماعية لمساعدتك على إعداد اتصالات مع أصدقائك",
        "description": "Explains why uProxy needs social networks. (Friends need to login with the same social network on uProxy for friends to see each other.)"
    },
    "TO_SEND_LOGS": {
        "message": "لإرسال سجلاتك إلى فريق uProxy طلباً للمساعدة، افتح uProxy وانقر \"تقديم تعليق\"",
        "description": "Instructions guiding the user through how to submit their logs to uProxy."
    },
    "CANCEL": {
        "message": "إلغاء",
        "description": "Button label that rejects a proposed action."
    },
    "FEEDBACK_SUBMITTED": {
        "message": "تم تقديم تعليقاتك إلى فريق تطوير uProxy.",
        "description": "User feedback was successfully submitted."
    },
    "ABOUT_UPROXY": {
        "message": "يساعدك uProxy على مشاركة إمكانية وصولك إلى الإنترنت أو على تحقيق الوصول عبر صديق",
        "description": "Description on uProxy's introduction screen explaining what uProxy is."
    },
    "EDIT_ADVANCED_SETTINGS_PLACEHOLDER": {
        "message": "تحرير إعداداتك",
        "description": "Default text in the advanced settings textbox."
    },
    "STATS_ENABLED_TOOLTIP": {
        "message": "أنت تشارك إحصائيات مجهولة المصدر.",
        "description": "Text that appears in a tooltip when the user hovers over the 'anonymous stats enabled' icon."
    },
    "DESCRIPTION_DEFAULT": {
        "message": "الحاسوب رقم  __number__",
        "description": "If a friend has more than one computer, the computers are given this default name (with increasing numbers) to differentiate them."
    },
    "FRIEND_NEEDS_TO_CLICK": {
        "message": "لإنهاء إعداد الاتصال، يحتاج صديقك للنقر على الوصلة وإرسال وصلة من عميل uProxy الخاص بهم لك. عندما تنقر عليها، ستكون مستعداً لبدء تحقيق الوصول.",
        "description": "Instructions telling the user that starting a one-time connection is waiting for action from their friend."
    },
    "OFFERS": {
        "message": "عروض",
        "description": "Title for the group of friends who have sent offers of access to their Internet, which the user have not yet accepted."
    },
    "DONE": {
        "message": "تم",
        "description": "Button label that suggests acknowledgement and that closes a popup."
    },
    "EXT_MISSING_MESSAGE": {
        "message": "تنزيل وتمكين الجزء 1 من uProxy للبدء.",
        "description": "Shown in Chrome to instruct the user to install part 1 of uProxy."
    },
    "CANCEL_OFFER": {
        "message": "إلغاء العرض",
        "description": "Label for button that takes back an offer to a friend who has not yet accepted that offer. If the button is clicked, the friend will no longer be able to connect to the Internet through the user."
    },
    "COPY_CONNECTION_LINK": {
        "message": "لطلب إمكانية الوصول من صديق، انسخ والصق هذا العنوان وأرسله إليهم عب قناة آمنة.",
        "description": "Instructions for the user to request access from a friend with a one-time link."
    },
    "LOADING": {
        "message": "جاري التحميل...",
        "description": "Message show when something is taking time to load."
    },
    "ASK_FOR_ACCESS": {
        "message": "طلب الوصول",
        "description": "Button label that sends a request to the user's friend, asking if the user can access the Internet through them."
    },
    "GRANTED_YOU_ACCESS": {
        "message": "منحك __name__ إمكانية الوصول",
        "description": "The user's friend has allowed the user to use the friend's Internet connection."
    },
    "CANT_OPEN_ONE_TIME_MESSAGE": {
        "message": "من غير الممكن حالياً فتح اتصال يدوي في نفس وقت الدخول إلى شبكة اجتماعية. لإطلاق الاتصال اليدوي، يُرجى الخروج من خلال قائمة الإعداد وإعادة لصق الوصلة.",
        "description": "Text for an error popup that appears if the user tries to open a one-time link while signed in to a social network."
    },
    "EXT_MISSING_TITLE": {
        "message": "أنت على وشك أن تكون مستعداً لاستعمال uProxy!",
        "description": "Shown in Chrome if the user has not finished installing both parts of uProxy."
    },
    "ONE_TIME_SUCCESS": {
        "message": "نجاح! تم إرساء اتصال لمرة واحدة.",
        "description": "Inform the user that a one-time connection was successfully established."
    },
    "ONE_TIME_GETTING": {
        "message": "أنت الآن تحصل على إمكانية الوصول.",
        "description": "The user is connected to the Internet through their friend."
    },
    "SET": {
        "message": "تعيين",
        "description": "Label for button that saves the user's advanced settings."
    },
    "GETTING_ACCESS_FROM": {
        "message": "الحصول على وصول من خلال __name__",
        "description": "Message in a status bar that is visible when the user is getting access from a friend."
    },
    "STARTED_PROXYING": {
        "message": "بدأ __name__ الاتصال بالإنترنت بالوكالة من خلالك",
        "description": "Notification for when a friend has started accessing the Internet through the user."
    },
    "TO_INVITE_FRIENDS": {
        "message": "لدعوة الأصدقاء إلى uProxy، أرسل لهم وصلة إلى https://www.uproxy.org",
        "description": "Instruction informing the user how to invite their friends to uProxy."
    },
    "VERY_LIKELY": {
        "message": "على الأغلب",
        "description": "Meaning high probability. Used in context of the probability that network settings are preventing a uProxy connection from being established. Used in analysisResults string."
    },
    "STATS_ENABLED_TITLE": {
        "message": "الإحصائيات المجهولة المصدر مُمكّنة",
        "description": "The user has elected to submit anonymous statistics about their uProxy usage to the uProxy team."
    },
    "APP_MISSING_MESSAGE": {
        "message": "تنزيل وتمكين الجزء 2 من uProxy للبدء.",
        "description": "Shown in Chrome to instruct the user to install part 2 of uProxy."
    },
    "UPROXY_FRIENDS": {
        "message": "الأصدقاء الذين لديهم uProxy",
        "description": "Title for the group of friends who have uProxy but who don't fit into any of the other contact groups."
    },
    "STOP_IGNORING_REQUESTS": {
        "message": "التوقف عن تجاهل الطلبات",
        "description": "Button label for if the user wants to stop ignoring requests."
    },
    "STOP_ONE_TIME_SHARING": {
        "message": "التوقف عن مشاركة الوصول",
        "description": "Label for button to terminate your connection to a friend who is accessing the Internet through you."
    },
    "SETTINGS_BAD_FORMAT_ERROR": {
        "message": "لم يمكن الإعداد: صيغة سيئة",
        "description": "Error shown to the user if their input for advanced settings is badly formed JSON."
    },
    "P_I_I_MESSAGE": {
        "message": "تعليقاتك وعنوان بريدك الإلكتروني سيرسلان إلى uProxy. org. قد تحتوي سجلاتك والمعلومات الخاصة بشبكتك وبريدك الإلكتروني معلومات تقود إلى التعرف على شخصك.",
        "description": "Message helping make sure the user understands that personally identifiable information may be included in their feedback to uProxy."
    },
    "SETTINGS_SAVED": {
        "message": "تم حفظ الإعدادات",
        "description": "Message that confirms to the user that their advanced settings were saved."
    },
    "OK": {
        "message": "موافق",
        "description": "Button label."
    },
    "GRANTED_FRIEND_ACCESS": {
        "message": "لقد أعطيتهم إمكانية الوصول.",
        "description": "The user has agreed to let their friend access the Internet through the user."
    },
    "OFFERED_ACCESS_NOTIFICATION": {
        "message": "عرض عليك __name__ وصولاً",
        "description": "Notification for when the user receives an offer from a friend to access the Internet through them."
    },
    "GRANT": {
        "message": "منح",
        "description": "Label for button that accepts a friend's request to access the Internet through the user."
    },
    "NO_LONGER_GETTING": {
        "message": "لم تعد محققاً للوصول. لطلب اتصال، انقر على الزر أدناه.",
        "description": "Message shown when a one-time connection ends."
    },
    "NAME_THIS_DEVICE": {
        "message": "تسمية هذا الجهاز",
        "description": "If the user has not named their device (e.g. 'laptop' or 'home computer'), they will see this message in the Settings panel."
    },
    "FEEDBACK_PLACEHOLDER": {
        "message": "اكتب تعليقك",
        "description": "The default text that appears in the user feedback textbox."
    },
    "CONNECTED_ACCOUNTS": {
        "message": "الحسابات المتصلة",
        "description": "In settings, title for the social networks you can connect to."
    },
    "DESCRIPTION": {
        "message": "الوصف",
        "description": "Placeholder for the input field for the name of the user's device."
    },
    "ADVANCED_SETTINGS": {
        "message": "طلب الوصول",
        "description": "Clickable text from the Settings menu. Clicking this opens the advanced settings screen."
    },
    "ERROR_STARTING_CONNECTION": {
        "message": "حدث خطأ عند بدء الاتصال وكان لزاماً إنهاءه. يرجى بدء اتصال آخر.",
        "description": "Error shown if a one-time connection failed to start."
    }
}