{
    "friendOffline": {
        "message": "__name__çevrimdışı",
        "description": "Message shown when trying to get access from a friend who is offline."
    },
    "sendConnectionLink": {
        "message": "Bağlantını paylaşmak için, lütfen arkadaşından sana linklerini göndermesini iste. ",
        "description": "Instructions for the user to share their connection with a one-time link."
    },
    "welcome": {
        "message": "uProxy'e Hoşgeldiniz",
        "description": ""
    },
    "oneTimeSharing": {
        "message": "Şu anda erişim paylaşıyorsun.",
        "description": "The user is sharing their Internet access with a friend."
    },
    "requestingAccessNotification": {
        "message": "__name__ erişim istiyor",
        "description": "Notification for when a friend sends a request to access the Internet through the user."
    },
    "changeStatsChoice": {
        "message": "Tercihini istediğin an , Ayarlar menüsünden değiştirebilirsin. ",
        "description": "Informs the user that they can opt in and out of sending anonymous statistics at any time they choose, from the Settings menu."
    },
    "sharingAccessWith_two": {
        "message": "__name1__ ve __name2__ ile erişim paylaşıyor",
        "description": "Message in a status bar that is visible when two friends are getting access through the user."
    },
    "emailInsteadMessage": {
        "message": "Ay! Geri bildirimini uproxy.org'a gönderemedik. Lütfen geri bildirimini kopyala ve info@uproxy.org'a bir epostaya yapıştır.",
        "description": "Seen if feedback submission through uProxy fails. Message asks users to email their feedback instead."
    },
    "weWontPost": {
        "message": "Verilerini ya da iletilerini senin iznin olmadan halkla paylaşmayacağız",
        "description": "Inform the user that uProxy does not share data or post to their social network accounts without agreement from the user."
    },
    "imIn": {
        "message": "Bağlandım",
        "description": "Agree to submitting anonymous metrics to uProxy."
    },
    "stopOneTimeInstruction": {
        "message": "Arkadaşından erişim almayı sonlandırmak için, ",
        "description": ""
    },
    "thankYou": {
        "message": "Teşekkürler!",
        "description": ""
    },
    "emailInsteadTitle": {
        "message": "Eposta geri dönüşünün yerine?",
        "description": "Title for error that appears if feedback submission failed."
    },
    "selectLanguage": {
        "message": "Bir dil seç",
        "description": "Instruction to select language used by the application."
    },
    "getHelp": {
        "message": "Yardım Al",
        "description": "Get help from the frequently asked questions page."
    },
    "yes": {
        "message": "Evet",
        "description": "Button label."
    },
    "submitFeedback_sentenceCase": {
        "message": "Geri bildirim gönder",
        "description": "Submit feedback to the uProxy team."
    },
    "getOneTimeInsteadInstruction": {
        "message": "Başka birisiyle tek seferlik bir bağlantı başlatmak istiyorsan, \"Geri\" butonuna ve sonra yeni bir oturum başlatmak için \"Tek seferlik bir bağlantı başlat\"a bas.",
        "description": "Instructions for the user if they want to abort an existing attempt and start a new one-time connection."
    },
    "errorParsingLink": {
        "message": "uProxy bağlantı linkini çözümlerken bir hata oluştu, lütfen linke tekrar yönlendirmeyi ya da arkadaşından yeni bir link istemeyi dene.",
        "description": "Error shown if a one-time connection link did not work."
    },
    "feedbackTitle": {
        "message": "Geri bildiriminizi aşağıya girin",
        "description": "Label for textbox for user's to submit feedback and comments to uProxy."
    },
    "howToOfferOneTime": {
        "message": "Onlara erişim vermek istiyorsan, bu URL'yi kopyala ve onlara geri yapıştır.",
        "description": "Instructions for user if they'd like to share their Internet connection with a one-time link."
    },
    "loadingFriends": {
        "message": "uProxy arkadaşlarını yüklüyor",
        "description": "User's friends are being loaded from a social network."
    },
    "acceptOffer": {
        "message": "Teklifi Kabul Et",
        "description": "Accept a friend's offer that would allow the user to access the Internet through their friend."
    },
    "sharingAccessWith_one": {
        "message": "__name__ ile erişim paylaşılıyor",
        "description": "Message in a status bar that is visible when one friend is getting access through the user."
    },
    "statsEnabledMessage": {
        "message": "Bu simge anonim istatistikleri uProxy takımıyla paylaşmayı tercih ettiğiniz anlamına gelir. Ayarları düzenlemek için tıkla.",
        "description": "Text that appears in a popup explaining the 'anonymous stats enabled' icon."
    },
    "requests": {
        "message": "İstekler",
        "description": "Title for the group of friends who have sent requests to access the user's Internet, which the user have not yet granted."
    },
    "startGetting": {
        "message": "Erişim almaya başla",
        "description": "Start accessing the Internet through a friend's connection."
    },
    "stopGetting": {
        "message": "Erişimi durdur",
        "description": "Stop accessing the Internet through a friend's connection."
    },
    "advancedSettings_sentenceCase": {
        "message": "Gelişmiş ayarlar",
        "description": "Title for the advanced settings screen."
    },
    "enableMetrics": {
        "message": "Anonim metrikler koleksiyonunu etkinleştirmek ister misin?",
        "description": "Asks the user if they want to send anonymous metrics about their uProxy usage."
    },
    "tryingToShareOneTime": {
        "message": "Şu anda erişimi paylaşmaya çalışma aşamasındasın. Bunun yerine erişim edinmek istersen, yukarıdaki linke tıkla.",
        "description": "Instructions for user if they want to get access instead, while attempting to share access."
    },
    "language": {
        "message": "Dil",
        "description": "Language used by the application."
    },
    "unlikely": {
        "message": "muhtemelen değil",
        "description": "Meaning very low probability. Used in context of the probability that network settings are preventing a uProxy connection from being established. Used in analysisResults string."
    },
    "alphaMessage": {
        "message": "Bu, uProxy'nin bir alpha sürümü. Anonim metrikleri geliştirme ekibiyle paylaşarak, uProxy'i geliştirmemize yardım edebilirsin. Raporlanan veri müşteri tarafından anonim hale getirilir ve güvenli bir şekilde iletilir.",
        "description": "Text in a popup that appears wen the user first uses uProxy. Explains that the current version of uProxy is an early, unfinished release, and anonymous statistics (from the user, if they choose) can help with uProxy's development."
    },
    "moreInformation": {
        "message": "Daha fazla bilgi.",
        "description": ""
    },
    "possibly": {
        "message": "belki",
        "description": "Meaning medium probability. Used in context of the probability that network settings are preventing a uProxy connection from being established. Used in analysisResults string."
    },
    "friendRequestsAccess": {
        "message": "__name__sizden erişim istiyor.",
        "description": "A friend has requested to access the Internet through the user."
    },
    "getOneTimeInstead": {
        "message": "Yerine erişim edin",
        "description": "Label for a link to the 'Start a one-time connection' page."
    },
    "setUpOneTime": {
        "message": "Tek seferlik bir bağlantı kur",
        "description": "Clickable link on the login page. As an alternative to logging in to a social network, user's can attempt a connection with a one-time link."
    },
    "friendRequestedOneTime": {
        "message": "Arkadaşın senin İnternet bağlantını kullanmak istiyor.",
        "description": "A friend has requested to access the Internet through the user."
    },
    "no": {
        "message": "Hayır",
        "description": "Button label."
    },
    "areYouSure": {
        "message": "Bu tek seferlik bağlantıyı bitirmek istediğinden emin misin?",
        "description": "Question confirming if the user wants to end an active connection to a friend."
    },
    "acceptedOfferNotification": {
        "message": "__name__erişim için teklifinizi kabul etti",
        "description": "Notification for when a friend has accepted the user's offer to share their Internet with that friend."
    },
    "sharingUnavailableTitle": {
        "message": "Paylaşım Uygun Değil",
        "description": "Title for error that appears when the user can not share their Internet access with friends."
    },
    "learnMoreUproxy": {
        "message": "uProxy hakkında daha fazla öğrenin",
        "description": "Label for button that brings user to more information about uProxy."
    },
    "startOneTimeInstruction": {
        "message": "Arkadaşından erişim almaya başlamak için, aşağıdaki butona tıkla.",
        "description": ""
    },
    "noFriendsOnline": {
        "message": "Şu anda hiçbir arkadaşınız uProxy'e giriş yapmış değil.",
        "description": "None of the user's friends are currently signed in."
    },
    "continueBrowsing": {
        "message": "uProxy Olmadan Göz Atmaya Devam Et",
        "description": "Label for button that will change the users Internet settings back to using the user's local connection (i.e. not their friend's Internet)."
    },
    "grantedAccessNotification": {
        "message": "__name__ size erişim bağışladı",
        "description": "Notification for when a user's request to access the Internet through a friend has been accepted by that friend."
    },
    "emailTitle": {
        "message": "Eposta (opsiyonel)",
        "description": ""
    },
    "askToAnalyze": {
        "message": "Ağının NAT tipi uProxy ile uyumlu olmayabilir. uProxy'nin ağını analiz etmesini ister misin?",
        "description": "Text in a popup that appears when an attempt to access the Internet through a friend fails."
    },
    "shareOneTime": {
        "message": "Tek seferlik bir bağlantı paylaşın",
        "description": "Share access to the user's Internet using a link that will only work once."
    },
    "askToSubmitAnalysis": {
        "message": "Kullanıcılarımızın bulunduğu ağları daha iyi anlamamıza yardım etmek için, NAT tipinizi uProxy takımına sunmak ister misin? ",
        "description": "Asks the user if they are willing to share their network analysis results with uProxy, to help the development of uProxy."
    },
    "getAccess": {
        "message": "Erişim Edinin",
        "description": "Text for the tab on the toolbar. When the user is on the 'Get Access' tab, they are looking to get access to the Internet through a friend."
    },
    "retrievingLogs": {
        "message": "Girişleri alıyor ve ağınızı analiz ediyor...",
        "description": "Message shown while uProxy is analyzing the user's network settings."
    },
    "learnMoreSocial": {
        "message": "Sosyal ağlar hakkında daha fazla öğrenin",
        "description": "Label for button that brings user to more information about why social networks are used for uProxy."
    },
    "waitingForAccess": {
        "message": "__name__ kabul ettiğinde erişim edinebileceksin.",
        "description": "User will be able to access the Internet through their friend, once that friend gives the user permission."
    },
    "connectedWith": {
        "message": "__network__ ile bağlandı",
        "description": "Text in settings that informs the user which social network they're connected to."
    },
    "requestOneTime": {
        "message": "Tek seferlik bağlantı iste",
        "description": "Request access to the user's friend's Internet using a link that will only work once."
    },
    "connect": {
        "message": "Bağlan",
        "description": "User clicks this to connect to a network"
    },
    "close": {
        "message": "Kapa",
        "description": "Button label to close a popup."
    },
    "deviceDescription": {
        "message": "Cihaz tarifi",
        "description": "Title for the section in Settings where the user can edit the name of their device."
    },
    "logout": {
        "message": "uProxy'den çıkış yap",
        "description": "Log-out of uProxy."
    },
    "editAdvancedSettings": {
        "message": "Aşağıdaki ayarlarınızı düzenleyin",
        "description": "Instruction for the user to edit their advanced settings (by typing JSON in a textbox)."
    },
    "revokeAccess": {
        "message": "Erişimi Geri Çek",
        "description": "Label for button that takes back an offer to a friend who has already accepted that offer. If the button is clicked, the friend will no longer be able to connect to the Internet through the user."
    },
    "unableToGetFrom": {
        "message": "__name__den erişim alamıyor",
        "description": "Error message seen in uProxy when the user failed to get access to the Internet through a friend."
    },
    "friendsWhoCanGet": {
        "message": "Sizden erişim alabilen arkadaşlar",
        "description": "Title for the group of friends who can access the Internet through the user."
    },
    "submitFeedback": {
        "message": "Geribildirim Gönder",
        "description": "Submit feedback to the uProxy team."
    },
    "askingForAccess": {
        "message": "Erişim istiyor",
        "description": "The user is asking for permission to access the Internet through their friend; user is waiting for the friend's reply."
    },
    "analyzingNetwork": {
        "message": "Bağlantı analiz ediliyor",
        "description": "Message shown when the user's network is being analyzed."
    },
    "stopOneTimeGettingBeforeNew": {
        "message": "Yeni bir tek seferlik bağlantı başlatmak istiyorsan, ilk olarak \"Erişim Almayı Durdur\"a bas. ",
        "description": "Instruction for the user to stop a current one-time connection if they want to start a new one."
    },
    "moreInfo": {
        "message": "Daha fazla bilgi",
        "description": "Link to 'Does uProxy log data about me?' question in the FAQ."
    },
    "privacyPolicy": {
        "message": "Gizlilik politikası",
        "description": "Link to uProxy's privacy policy."
    },
    "stopIgnoringOffers": {
        "message": "Teklifleri göz ardı etmeyi bırak",
        "description": "Button label for if the user wants to stop ignoring offers."
    },
    "errorSigningIn": {
        "message": "__network__e girişte bir problem oldu. Lütfen tekrar deneyin.",
        "description": "Notification for when the user could not be signed in to a social network."
    },
    "unableToGet": {
        "message": "Erişim edinemiyor",
        "description": "Title for popup that appears when an attempt to access the Internet through a friend fails."
    },
    "sharingEnabledMessage": {
        "message": "Bu simge erişim önerdiğiniz arkadaşlarınızla paylaşıma müsait olduğunuz anlamına gelir.",
        "description": "Text in a popup that explains what the sharing icon (on the toolbar) is."
    },
    "stopOneTimeSharingBeforeNew": {
        "message": "Yeni bir, tek seferlik bağlantı başlatmak istiyorsan, ilk olarak \"Erişim Paylaşmayı Durdur\".",
        "description": "Instruction for the user to stop a current one-time connection if they want to start a new one."
    },
    "ignore": {
        "message": "Göz ardı et",
        "description": "Button label that ignores an offer or request."
    },
    "logsTitle": {
        "message": "Girişler ve Ağ Analizi",
        "description": "Title for the page that displays a user's network information and uProxy logs."
    },
    "friendRequestedAccess": {
        "message": "Senden erişim istediler.",
        "description": "A friend has requested to access the Internet through the user."
    },
    "goBack": {
        "message": "Geri dönmek mi?",
        "description": "Go back to the main page from the one-time connection page."
    },
    "accessNotGranted": {
        "message": "Onlara erişim bahşetmedin.",
        "description": "The user has not permissioned a friend to access the Internet through the user."
    },
    "networkAndLogs": {
        "message": "Ağı analiz et ve girişleri dahil et",
        "description": "Label for a checkbox that indicates if the user wants uProxy to analyze their network settings and include their uProxy logs with their feedback to the uProxy team."
    },
    "welcomeMessage": {
        "message": "Başlamak için, \"Erişim edin\" ya da \"Erişim paylaş\" ı seç ve sonra bağlanmak için bir arkadaşa tıkla.",
        "description": "Text in a popup that appears when the user first uses uProxy. Explains that the user needs to choose either the Get or Share tab appropriately."
    },
    "noThanks": {
        "message": "Hayır teşekkürler",
        "description": "Do not agree to submitting anonymous metrics to uProxy."
    },
    "friendsWhoShare": {
        "message": "Arkadaşlar buradan erişim edinebilirsiniz",
        "description": "Title for the group of friends who the user can get Internet access from."
    },
    "unableToShareWith": {
        "message": "__name__ ile erişimi paylaşamadı",
        "description": "Error message seen in uProxy when a friend failed to get access to the Internet through the user."
    },
    "settingsJsonError": {
        "message": "Ayarlanamadı: JSON değeri eşleşmemesi",
        "description": "Error shown to the user if their input for advanced settings is incomplete or incompatible with expected settings configurations."
    },
    "offerAccess": {
        "message": "Erişim Teklif Et",
        "description": "Label for button that will offer a friend access to the Internet through the user, even though the friend has not requested access."
    },
    "next": {
        "message": "Sonraki",
        "description": "Label for button that proceeds from the introduction page to the login page."
    },
    "sharingUnavailableMessage": {
        "message": "Ay! İşten (see git.io/vf5x1) paylaşmayı engelleyen bir hatası olan, Firefox 37 kullanıyorsun. Bu hata Firefox 38'de düzeltildi, bu nedenle Firefox'u yükselterek ya da Chrome'a geçerek paylaşımı etkinleştirebilirsin.",
        "description": "Text for error that appears when the user can not share their Internet access with friends."
    },
    "analysisResults": {
        "message": "Arkadaşlarına bağlanmak için yeteneğinle arana giren __natImpact__ olan bir__natType__ta gibi görünüyorsun, ",
        "description": "A summary of the user's network analysis."
    },
    "sharingEnabledTitle": {
        "message": "Paylaşım Etkinleştirildi",
        "description": "Title for popup that points to the sharing icon in uProxy's top toolbar. The popup appears when the user first grants access to one of their friends. The sharing icon is visible as long as there are friends who can get access to the user's Internet."
    },
    "startNewConnection": {
        "message": "Yeni bir bağlantı almaya başla",
        "description": "Label for button that takes user back to the 'Start a one-time connection' page."
    },
    "appMissingTitle": {
        "message": "uProxy kullanmaya neredeyse hazırsın!",
        "description": "Shown in Chrome if the user has not finished installing both parts of uProxy."
    },
    "cancelRequest": {
        "message": "İsteği İptal Et",
        "description": "Label for button which will take back a request to get Internet access through a friend."
    },
    "sharingAccessWith_many": {
        "message": "__name__ ve __numOthers__ diğerleriyle erişim paylaşılıyor",
        "description": "Message in a status bar that is visible when three or more friends are getting access through the user."
    },
    "cannotOpenOneTimeTitle": {
        "message": "Tek seferlik bağlantıyı açamıyor",
        "description": "Title for an error popup that appears if the user tries to open a one-time link while signed in to a social network."
    },
    "loggedOut": {
        "message": "__network__ten çıkışın yapıldı",
        "description": "Notification for when the user has been logged out of the social network."
    },
    "restart": {
        "message": "Yeniden Başla",
        "description": "Restart uProxy completely."
    },
    "startOneTime": {
        "message": "Tek seferlik bir bağlantıya başla",
        "description": "Start an Internet connection using a link that will only work once."
    },
    "stoppedProxying": {
        "message": "__name__senden proxy'i sonlandırdı",
        "description": "Notification for when a friend has stopped accessing the Internet through the user."
    },
    "disconnectedTitle": {
        "message": "Ay! Arkadaşınızla bağlantınız kesildi.",
        "description": "Title for error that appears when the user was getting access to the Internet through their friend, but that connection was terminated."
    },
    "connectedWithNumber": {
        "message": "__number__ağla bağlandı",
        "description": "Text in settings informing the user of how many networks they're connected to."
    },
    "attemptingReconnect": {
        "message": "Yeniden bağlanmaya çalışıyor.",
        "description": "uProxy was disconnected from the social network and is trying to reconnect."
    },
    "whichSocialNetwork": {
        "message": "Kontaklarınızı en çabuk nerede bulabilirsiniz?",
        "description": "Question seen at the top of uProxy's login page. Asks which social network should be used to find the user's friends."
    },
    "tryingToConnect": {
        "message": "__isme__ bağlanmaya çalışıyor",
        "description": "The user is trying to connect to the Internet through their friend."
    },
    "emailPlaceholder": {
        "message": "Eposta adresi",
        "description": ""
    },
    "save": {
        "message": "Kaydet",
        "description": "Label for button that saves the user's text input."
    },
    "offeredYouAccess": {
        "message": "Sana erişim teklif ettiler.",
        "description": "A friend has offered their Internet access to the user."
    },
    "sharingEnabledTooltip": {
        "message": "Paylaşmaya müsatsin.",
        "description": "Text that appears in a tooltip when the user hovers over the sharing icon."
    },
    "shareAccess": {
        "message": "Erişim Paylaş",
        "description": "Text for the tab on the toolbar. When the user is on the 'Share Access' tab, they are looking to share access to their Internet with a friend."
    },
    "disconnect": {
        "message": "Bağlantıyı kes",
        "description": "User clicks this to disconnect from a network"
    },
    "unableToShare": {
        "message": "Erişimi paylaşamıyor",
        "description": "Title for popup that appears when an attempt to share the Internet with a friend fails."
    },
    "disconnectedMessage": {
        "message": "Lütfen dikkatli bir şekilde ilerleyin. Web trafiğin artık arkadaşına yönlendirilmeyecek. İlerlemeden önce, açtığın herhangi bir hassas pencereyi kapatmak isteyebilirsin. ",
        "description": "Instruction informing the user that to continue browsing the Internet, the user will need to use their local (potentially unsafe and/or censored) connection."
    },
    "whySocialNetwork": {
        "message": "uProxy, arkadaşlarınla bağlantı kurmana yardım etmek için sosyal ağları kullanır ",
        "description": "Explains why uProxy needs social networks. (Friends need to login with the same social network on uProxy for friends to see each other.)"
    },
    "toSendLogs": {
        "message": "Girişlerini yardım amacıyla uProxy takımına göndermek için, uProxy'i aç ve 'Geri bildirim Gönder' e tıkla",
        "description": "Instructions guiding the user through how to submit their logs to uProxy."
    },
    "cancel": {
        "message": "Iptal",
        "description": "Button label that rejects a proposed action."
    },
    "feedbackSubmitted": {
        "message": "Geri bildiriminiz uProxy geliştirme ekibine gönderildi.",
        "description": "User feedback was successfully submitted."
    },
    "aboutUproxy": {
        "message": "uProxy internet erişimini paylaşmana ya da arkadaşlarından erişim almana yardım eder.",
        "description": "Description on uProxy's introduction screen explaining what uProxy is."
    },
    "editAdvancedSettingsPlaceholder": {
        "message": "Ayarlarını düzenle",
        "description": "Default text in the advanced settings textbox."
    },
    "statsEnabledTooltip": {
        "message": "Anonim istatistikler paylaşıyorsun.",
        "description": "Text that appears in a tooltip when the user hovers over the 'anonymous stats enabled' icon."
    },
    "descriptionDefault": {
        "message": "Bilgisayar__number__",
        "description": "If a friend has more than one computer, the computers are given this default name (with increasing numbers) to differentiate them."
    },
    "friendNeedsToClick": {
        "message": "Bağlantının kurulumunu bitirmek için, arkadaşının linke tıklaması ve uProxy istemcisinden sana bir link göndermesi gerekli. Üzerine tıkladığında, erişim edinmeye başlamaya hazır olacaksın.",
        "description": "Instructions telling the user that starting a one-time connection is waiting for action from their friend."
    },
    "offers": {
        "message": "Teklifler",
        "description": "Title for the group of friends who have sent offers of access to their Internet, which the user have not yet accepted."
    },
    "done": {
        "message": "Tamamlandı",
        "description": "Button label that suggests acknowledgement and that closes a popup."
    },
    "extMissingMessage": {
        "message": "Başlamak için uProxy'nin 1. bölümünü indir ve etkinleştir.",
        "description": "Shown in Chrome to instruct the user to install part 1 of uProxy."
    },
    "cancelOffer": {
        "message": "Teklifi İptal Et",
        "description": "Label for button that takes back an offer to a friend who has not yet accepted that offer. If the button is clicked, the friend will no longer be able to connect to the Internet through the user."
    },
    "copyConnectionLink": {
        "message": "Bir arkadaşından erişim istemek için, bu URL'yi güvenli bir kanal üzerinden onlara kopyala ve yapıştır",
        "description": "Instructions for the user to request access from a friend with a one-time link."
    },
    "loading": {
        "message": "Yükleniyor...",
        "description": "Message show when something is taking time to load."
    },
    "askForAccess": {
        "message": "Erişim sor",
        "description": "Button label that sends a request to the user's friend, asking if the user can access the Internet through them."
    },
    "grantedYouAccess": {
        "message": "__name__size erişim bağışladı",
        "description": "The user's friend has allowed the user to use the friend's Internet connection."
    },
    "cantOpenOneTimeMessage": {
        "message": "Aynı anda bir sosyal ağa bağlandığından şu anda yeni bir manuel bağlantı açmak mümkün değil. Bir manuel bağlantı başlatmak için, lütfen ayarlar menüsünden çıkış yap ve linki yeniden yapıştır.",
        "description": "Text for an error popup that appears if the user tries to open a one-time link while signed in to a social network."
    },
    "extMissingTitle": {
        "message": "uProxy kullanmaya neredeyse hazırsın!",
        "description": "Shown in Chrome if the user has not finished installing both parts of uProxy."
    },
    "oneTimeSuccess": {
        "message": "Başarılı! Tek seferlik bir bağlantı kuruldu.",
        "description": "Inform the user that a one-time connection was successfully established."
    },
    "oneTimeGetting": {
        "message": "Şu anda erişim alıyorsunuz.",
        "description": "The user is connected to the Internet through their friend."
    },
    "set": {
        "message": "AYARLA",
        "description": "Label for button that saves the user's advanced settings."
    },
    "gettingAccessFrom": {
        "message": "__name__'den erişim alıyor",
        "description": "Message in a status bar that is visible when the user is getting access from a friend."
    },
    "startedProxying": {
        "message": "__name__senden proxy'e başladı",
        "description": "Notification for when a friend has started accessing the Internet through the user."
    },
    "toInviteFriends": {
        "message": "Arkadaşlarını uProxy'e davet etmek için, onlara https://www.uproxy.org'dan bir link gönder",
        "description": "Instruction informing the user how to invite their friends to uProxy."
    },
    "veryLikely": {
        "message": "en olası",
        "description": "Meaning high probability. Used in context of the probability that network settings are preventing a uProxy connection from being established. Used in analysisResults string."
    },
    "statsEnabledTitle": {
        "message": "Anonim istatistikler etkinleştirildi",
        "description": "The user has elected to submit anonymous statistics about their uProxy usage to the uProxy team."
    },
    "appMissingMessage": {
        "message": "Başlamak için uProxy'nin 2. kısmını indir ve etkinleştir. ",
        "description": "Shown in Chrome to instruct the user to install part 2 of uProxy."
    },
    "uproxyFriends": {
        "message": "uProxy'si olan arkadaşlar",
        "description": "Title for the group of friends who have uProxy but who don't fit into any of the other contact groups."
    },
    "stopIgnoringRequests": {
        "message": "İstekleri göz ardı etmeyi bırak",
        "description": "Button label for if the user wants to stop ignoring requests."
    },
    "stopOneTimeSharing": {
        "message": "Erişim paylaşmayı sonlandırın",
        "description": "Label for button to terminate your connection to a friend who is accessing the Internet through you."
    },
    "settingsBadFormatError": {
        "message": "Ayarlanamadı: kötü format",
        "description": "Error shown to the user if their input for advanced settings is badly formed JSON."
    },
    "PIIMessage": {
        "message": "Geri bildirimin ve eposta adresin uProxy.org'a gönderilecek. Girişlerin, ağ bilgin ve epostan kişisel olarak tanınabilir bilgiyi içerebilir.",
        "description": "Message helping make sure the user understands that personally identifiable information may be included in their feedback to uProxy."
    },
    "settingsSaved": {
        "message": "Ayarlar kaydedildi",
        "description": "Message that confirms to the user that their advanced settings were saved."
    },
    "ok": {
        "message": "Tamam",
        "description": "Button label."
    },
    "grantedFriendAccess": {
        "message": "Onlara erişim verdiniz.",
        "description": "The user has agreed to let their friend access the Internet through the user."
    },
    "offeredAccessNotification": {
        "message": "__name__size erişim sundu",
        "description": "Notification for when the user receives an offer from a friend to access the Internet through them."
    },
    "grant": {
        "message": "Bağış",
        "description": "Label for button that accepts a friend's request to access the Internet through the user."
    },
    "noLongerGetting": {
        "message": "Artık erişim almıyorsun. Bir bağlantı istemek için, aşağıdaki bağlantıya tıklayın.",
        "description": "Message shown when a one-time connection ends."
    },
    "nameThisDevice": {
        "message": "Bu cihazı adlandırın",
        "description": "If the user has not named their device (e.g. 'laptop' or 'home computer'), they will see this message in the Settings panel."
    },
    "feedbackPlaceholder": {
        "message": "Geri bildiriminizi yazın",
        "description": "The default text that appears in the user feedback textbox."
    },
    "connectedAccounts": {
        "message": "Bağlanılan Hesaplar",
        "description": "In settings, title for the social networks you can connect to."
    },
    "description": {
        "message": "Tarif",
        "description": "Placeholder for the input field for the name of the user's device."
    },
    "advancedSettings": {
        "message": "Gelişmiş Ayarlar",
        "description": "Clickable text from the Settings menu. Clicking this opens the advanced settings screen."
    },
    "errorStartingConnection": {
        "message": "Bağlantıyı başlatırken bir hata oluştu ve sonlandırılması gerekti. Lütfen başka bir bağlantı başlatmayı deneyin.",
        "description": "Error shown if a one-time connection failed to start."
    }
}