{
  "done": {
    "message": "Fini",
    "description": "Button label that suggests acknowledgement and that closes a popup."
  },
  "yes": {
    "message": "Oui",
    "description": "Button label."
  },
  "no": {
    "message": "Aucun",
    "description": "Button label."
  },
  "ok": {
    "message": "OK",
    "description": "Button label."
  },
  "close": {
    "message": "Près",
    "description": "Button label to close a popup."
  },
  "cancel": {
    "message": "Annuler",
    "description": "Button label that rejects a proposed action."
  },
  "startGetting": {
    "message": "Commencer à obtenir l'accès",
    "description": "Start accessing the Internet through a friend's connection."
  },
  "stopGetting": {
    "message": "Arrêtez avoir accès",
    "description": "Stop accessing the Internet through a friend's connection."
  },
  "submitFeedback": {
    "message": "Envoyer des commentaires",
    "description": "Submit feedback to the uProxy team."
  },
  "getHelp": {
    "message": "Obtenir De L'Aide",
    "description": "Get help from the frequently asked questions page."
  },
  "logout": {
    "message": "Absent uProxy",
    "description": "Log-out of uProxy."
  },
  "grantedYouAccess": {
    "message": "__name__ vous en a donné l'accès",
    "description": "The user's friend has allowed the user to use the friend's Internet connection."
  },
  "tryingToConnect": {
    "message": "Essayer de se connecter à __NAME__",
    "description": "The user is trying to connect to the Internet through their friend."
  },
  "askingForAccess": {
    "message": "Demander de l'accès",
    "description": "The user is asking for permission to access the Internet through their friend; user is waiting for the friend's reply."
  },
  "waitingForAccess": {
    "message": "Vous serez en mesure d'obtenir l'accès lorsque __name__ accepte.",
    "description": "User will be able to access the Internet through their friend, once that friend gives the user permission."
  },
  "cancelRequest": {
    "message": "Demande D'Annulation",
    "description": "Label for button which will take back a request to get Internet access through a friend."
  },
  "offeredYouAccess": {
    "message": "Ils ont offert l'accès vous.",
    "description": "A friend has offered their Internet access to the user."
  },
  "acceptOffer": {
    "message": "Accepter une offre",
    "description": "Accept a friend's offer that would allow the user to access the Internet through their friend."
  },
  "ignore": {
    "message": "Ignorer",
    "description": "Button label that ignores an offer or request."
  },
  "stopIgnoringOffers": {
    "message": "Cesser d'ignorer les offres",
    "description": "Button label for if the user wants to stop ignoring offers."
  },
  "askForAccess": {
    "message": "Demandez un accès",
    "description": "Button label that sends a request to the user's friend, asking if the user can access the Internet through them."
  },
  "friendOffline": {
    "message": "__name__ est déconnecté",
    "description": "Message shown when trying to get access from a friend who is offline."
  },
  "grantedFriendAccess": {
    "message": "Vous leur avez donné accès.",
    "description": "The user has agreed to let their friend access the Internet through the user."
  },
  "revokeAccess": {
    "message": "Révoquer l'accès",
    "description": "Label for button that takes back an offer to a friend who has already accepted that offer. If the button is clicked, the friend will no longer be able to connect to the Internet through the user."
  },
  "cancelOffer": {
    "message": "Annuler Offre",
    "description": "Label for button that takes back an offer to a friend who has not yet accepted that offer. If the button is clicked, the friend will no longer be able to connect to the Internet through the user."
  },
  "friendRequestsAccess": {
    "message": "__name__ demande d'accès auprès de vous.",
    "description": "A friend has requested to access the Internet through the user."
  },
  "grant": {
    "message": "Subvention",
    "description": "Label for button that accepts a friend's request to access the Internet through the user."
  },
  "friendRequestedAccess": {
    "message": "Ils ont demandé l'accès à travers vous.",
    "description": "A friend has requested to access the Internet through the user."
  },
  "stopIgnoringRequests": {
    "message": "Cesser d'ignorer les demandes",
    "description": "Button label for if the user wants to stop ignoring requests."
  },
  "accessNotGranted": {
    "message": "Vous les avez pas accordé l'accès.",
    "description": "The user has not permissioned a friend to access the Internet through the user."
  },
  "offerAccess": {
    "message": "Offre d'accès",
    "description": "Label for button that will offer a friend access to the Internet through the user, even though the friend has not requested access."
  },
  "shareOneTime": {
    "message": "Partager une connexion unique",
    "description": "Share access to the user's Internet using a link that will only work once."
  },
  "requestOneTime": {
    "message": "Demander une connexion unique",
    "description": "Request access to the user's friend's Internet using a link that will only work once."
  },
  "startOneTime": {
    "message": "Lancer une connexion unique",
    "description": "Start an Internet connection using a link that will only work once."
  },
  "errorParsingLink": {
    "message": "Il y avait une erreur d'analyse le lien de connexion uproxy, s'il vous plaît essayer de naviguer à nouveau le lien ou demander à votre ami pour un nouveau lien.",
    "description": "Error shown if a one-time connection link did not work."
  },
  "noLongerGetting": {
    "message": "Vous n'êtes plus avoir accès. Pour demander une connexion, cliquez sur le bouton ci-dessous.",
    "description": "Message shown when a one-time connection ends."
  },
  "startNewConnection": {
    "message": "Commencer à obtenir une nouvelle connexion",
    "description": "Label for button that takes user back to the 'Start a one-time connection' page."
  },
  "errorStartingConnection": {
    "message": "Il y avait une erreur de lancer la connexion et il a dû être interrompue. S'il vous plaît essayez de démarrer une autre connexion.",
    "description": "Error shown if a one-time connection failed to start."
  },
  "sendConnectionLink": {
    "message": "Pour partager votre connexion, s'il vous plaît demander à votre ami de vous envoyer leur lien.",
    "description": "Instructions for the user to share their connection with a one-time link."
  },
  "copyConnectionLink": {
    "message": "Pour demander l'accès à partir d'un ami, de copier et coller cette URL pour eux sur un canal sécurisé",
    "description": "Instructions for the user to request access from a friend with a one-time link."
  },
  "loading": {
    "message": "Chargement ...",
    "description": "Message show when something is taking time to load."
  },
  "friendNeedsToClick": {
    "message": "Pour terminer la configuration de la connexion, votre ami a besoin de cliquer sur le lien et vous envoyer un lien à partir de leur client uProxy. Lorsque vous cliquez dessus, vous serez prêt à commencer à obtenir l'accès.",
    "description": "Instructions telling the user that starting a one-time connection is waiting for action from their friend."
  },
  "oneTimeSuccess": {
    "message": "Succès! Une connexion unique a été mis en place.",
    "description": "Inform the user that a one-time connection was successfully established."
  },
  "startOneTimeInstruction": {
    "message": "Pour commencer à obtenir l'accès à partir de votre ami, cliquez sur le bouton ci-dessous.",
    "description": ""
  },
  "stopOneTimeInstruction": {
    "message": "Pour arrêter avoir accès à partir de votre ami, cliquez sur le bouton ci-dessous.",
    "description": ""
  },
  "oneTimeGetting": {
    "message": "Vous êtes actuellement avoir accès.",
    "description": "The user is connected to the Internet through their friend."
  },
  "stopOneTimeGettingBeforeNew": {
    "message": "Si vous souhaitez démarrer une nouvelle connexion une seule fois, appuyez sur \"Stop avoir accès\" en premier.",
    "description": "Instruction for the user to stop a current one-time connection if they want to start a new one."
  },
  "friendRequestedOneTime": {
    "message": "Votre ami a demandé d'utiliser votre connexion Internet.",
    "description": "A friend has requested to access the Internet through the user."
  },
  "howToOfferOneTime": {
    "message": "Si vous souhaitez leur donner accès, de copier et coller cette URL vers eux.",
    "description": "Instructions for user if they'd like to share their Internet connection with a one-time link."
  },
  "getOneTimeInstead": {
    "message": "Accédez à la place",
    "description": "Label for a link to the 'Start a one-time connection' page."
  },
  "tryingToShareOneTime": {
    "message": "Vous êtes actuellement en train d'essayer de partager l'accès. Si vous souhaitez obtenir l'accès à la place, cliquez sur le lien ci-dessus.",
    "description": "Instructions for user if they want to get access instead, while attempting to share access."
  },
  "getOneTimeInsteadInstruction": {
    "message": "Si vous souhaitez démarrer une connexion unique avec quelqu'un d'autre, appuyez sur le bouton \"Retour\" puis \"Lancer une connexion unique\" pour commencer une nouvelle session.",
    "description": "Instructions for the user if they want to abort an existing attempt and start a new one-time connection."
  },
  "oneTimeSharing": {
    "message": "Vous partagez actuellement accès.",
    "description": "The user is sharing their Internet access with a friend."
  },
  "stopOneTimeSharing": {
    "message": "Arrêter le partage d'accès",
    "description": "Label for button to terminate your connection to a friend who is accessing the Internet through you."
  },
  "stopOneTimeSharingBeforeNew": {
    "message": "Si vous souhaitez démarrer une nouvelle connexion une seule fois, appuyez sur \"Arrêter le partage d'accès\" en premier.",
    "description": "Instruction for the user to stop a current one-time connection if they want to start a new one."
  },
  "goBack": {
    "message": "Retourner?",
    "description": "Go back to the main page from the one-time connection page."
  },
  "areYouSure": {
    "message": "Etes-vous sûr que vous voulez mettre fin à cette connexion une seule fois?",
    "description": "Question confirming if the user wants to end an active connection to a friend."
  },
  "submitFeedback_sentenceCase": {
    "message": "Envoyer des commentaires",
    "description": "Submit feedback to the uProxy team."
  },
  "emailTitle": {
    "message": "Email (facultatif)",
    "description": ""
  },
  "emailPlaceholder": {
    "message": "Adresse e-mail",
    "description": ""
  },
  "feedbackTitle": {
    "message": "Entrez vos commentaires ci-dessous",
    "description": "Label for textbox for user's to submit feedback and comments to uProxy."
  },
  "feedbackPlaceholder": {
    "message": "Donnez votre avis",
    "description": "The default text that appears in the user feedback textbox."
  },
  "networkAndLogs": {
    "message": "Analyser réseau et inclure des journaux",
    "description": "Label for a checkbox that indicates if the user wants uProxy to analyze their network settings and include their uProxy logs with their feedback to the uProxy team."
  },
  "PIIMessage": {
    "message": "Vos commentaires et adresse e-mail sera envoyé à uProxy.org. Votre journaux, les informations du réseau et le courrier électronique peuvent inclure des informations personnellement identifiables.",
    "description": "Message helping make sure the user understands that personally identifiable information may be included in their feedback to uProxy."
  },
  "thankYou": {
    "message": "Merci!",
    "description": ""
  },
  "feedbackSubmitted": {
    "message": "Votre commentaire a été soumis à l'équipe de développement uProxy.",
    "description": "User feedback was successfully submitted."
  },
  "emailInsteadTitle": {
    "message": "Email rétroaction à la place?",
    "description": "Title for error that appears if feedback submission failed."
  },
  "emailInsteadMessage": {
    "message": "Oops! Nous avons été incapables de soumettre vos commentaires afin uproxy.org. S'il vous plaît copier et coller vos commentaires dans un courriel à info@uproxy.org.",
    "description": "Seen if feedback submission through uProxy fails. Message asks users to email their feedback instead."
  },
  "logsTitle": {
    "message": "Logs & analyse de réseau",
    "description": "Title for the page that displays a user's network information and uProxy logs."
  },
  "toSendLogs": {
    "message": "Pour envoyer vos journaux à l'équipe uProxy de l'aide:",
    "description": "Instructions guiding the user through how to submit their logs to uProxy (part 1)."
  },
  "openFeedback": {
    "message": "ouvrir uProxy et cliquez sur «Soumettre Commentaires '",
    "description": "Instructions guiding the user through how to submit their logs to uProxy (part 2). This text is clickable and will open uProxy."
  },
  "retrievingLogs": {
    "message": "Récupération des logs et d'analyser votre réseau ...",
    "description": "Message shown while uProxy is analyzing the user's network settings."
  },
  "errorSigningIn": {
    "message": "Il y avait un problème connectez-vous à __network__. S'il vous plaît essayer à nouveau.",
    "description": "Notification for when the user could not be signed in to a social network."
  },
  "attemptingReconnect": {
    "message": "Tentative de re-connecter.",
    "description": "uProxy was disconnected from the social network and is trying to reconnect."
  },
  "cannotOpenOneTimeTitle": {
    "message": "Impossible d'ouvrir une connexion à temps",
    "description": "Title for an error popup that appears if the user tries to open a one-time link while signed in to a social network."
  },
  "cantOpenOneTimeMessage": {
    "message": "Il est actuellement impossible d'ouvrir une connexion manuelle en même temps comme étant connecté à un réseau social. Pour lancer une connexion manuelle, s'il vous plaît vous connecter à travers le menu des paramètres et re-coller le lien.",
    "description": "Text for an error popup that appears if the user tries to open a one-time link while signed in to a social network."
  },
  "statsEnabledTitle": {
    "message": "Stats anonymes activées",
    "description": "The user has elected to submit anonymous statistics about their uProxy usage to the uProxy team."
  },
  "statsEnabledMessage": {
    "message": "Cette icône signifie que vous avez choisi de partager des statistiques anonymes avec l'équipe uProxy. Cliquez pour ajuster les réglages.",
    "description": "Text that appears in a popup explaining the 'anonymous stats enabled' icon."
  },
  "statsEnabledTooltip": {
    "message": "Vous partagez statistiques anonymes.",
    "description": "Text that appears in a tooltip when the user hovers over the 'anonymous stats enabled' icon."
  },
  "sharingEnabledTitle": {
    "message": "Partage Enabled",
    "description": "Title for popup that points to the sharing icon in uProxy's top toolbar. The popup appears when the user first grants access to one of their friends. The sharing icon is visible as long as there are friends who can get access to the user's Internet."
  },
  "sharingEnabledMessage": {
    "message": "Cette icône signifie que vous êtes disponible pour partager l'accès avec des amis que vous avez offert l'accès à.",
    "description": "Text in a popup that explains what the sharing icon (on the toolbar) is."
  },
  "sharingEnabledTooltip": {
    "message": "Vous êtes disponible pour le partage.",
    "description": "Text that appears in a tooltip when the user hovers over the sharing icon."
  },
  "getAccess": {
    "message": "Avoir Accès",
    "description": "Text for the tab on the toolbar. When the user is on the 'Get Access' tab, they are looking to get access to the Internet through a friend."
  },
  "shareAccess": {
    "message": "Partager accès",
    "description": "Text for the tab on the toolbar. When the user is on the 'Share Access' tab, they are looking to share access to their Internet with a friend."
  },
  "welcome": {
    "message": "Bienvenue à uProxy",
    "description": ""
  },
  "welcomeMessage": {
    "message": "Pour commencer, choisissez «Accédez\" ou \"accès Partager\", puis cliquez sur un ami à se connecter.",
    "description": "Text in a popup that appears when the user first uses uProxy. Explains that the user needs to choose either the Get or Share tab appropriately."
  },
  "alphaMessage": {
    "message": "Ceci est une version alpha de uProxy. Vous pouvez nous aider à améliorer uProxy en partageant métriques anonymes avec l'équipe de développement. Les données communiquées sont anonymisées par le client et transmis de manière sécurisée.",
    "description": "Text in a popup that appears wen the user first uses uProxy. Explains that the current version of uProxy is an early, unfinished release, and anonymous statistics (from the user, if they choose) can help with uProxy's development."
  },
  "moreInformation": {
    "message": "Plus d'information.",
    "description": ""
  },
  "changeStatsChoice": {
    "message": "Vous pouvez modifier votre choix à tout moment, à partir du menu Paramètres.",
    "description": "Informs the user that they can opt in and out of sending anonymous statistics at any time they choose, from the Settings menu."
  },
  "enableMetrics": {
    "message": "Aimeriez-vous pour permettre la collecte de métriques anonyme?",
    "description": "Asks the user if they want to send anonymous metrics about their uProxy usage."
  },
  "imIn": {
    "message": "J'en suis",
    "description": "Agree to submitting anonymous metrics to uProxy."
  },
  "noThanks": {
    "message": "Non merci",
    "description": "Do not agree to submitting anonymous metrics to uProxy."
  },
  "disconnectedTitle": {
    "message": "Oops! Vous avez été déconnecté de votre ami.",
    "description": "Title for error that appears when the user was getting access to the Internet through their friend, but that connection was terminated."
  },
  "disconnectedMessage": {
    "message": "S'il vous plaît procéder avec prudence. Votre trafic Web ne sera plus acheminé par votre ami. Vous pouvez fermer toutes les fenêtres sensibles que vous avez ouvert, avant de continuer.",
    "description": "Instruction informing the user that to continue browsing the Internet, the user will need to use their local (potentially unsafe and/or censored) connection."
  },
  "continueBrowsing": {
    "message": "Continuer à parcourir Sans uProxy",
    "description": "Label for button that will change the users Internet settings back to using the user's local connection (i.e. not their friend's Internet)."
  },
  "sharingUnavailableTitle": {
    "message": "Partage Non disponible",
    "description": "Title for error that appears when the user can not share their Internet access with friends."
  },
  "sharingUnavailableMessage": {
    "message": "Oops! Vous utilisez Firefox 37, qui a un bug qui empêche le partage du travail (voir git.io/vf5x1). Ce bogue est résolu dans Firefox 38, de sorte que vous pouvez activer le partage de la mise à niveau de Firefox ou de passer à Chrome.",
    "description": "Text for error that appears when the user can not share their Internet access with friends."
  },
  "loadingFriends": {
    "message": "Chargement amis uProxy",
    "description": "User's friends are being loaded from a social network."
  },
  "noFriendsOnline": {
    "message": "Aucun de vos amis sur __network__ sont signés dans uProxy à cette époque.",
    "description": "None of the user's friends are currently signed in to the social network the user selected."
  },
  "toInviteFriends": {
    "message": "Pour inviter des amis à uProxy, leur envoyer un lien vers https://www.uproxy.org",
    "description": "Instruction informing the user how to invite their friends to uProxy."
  },
  "offers": {
    "message": "Offres",
    "description": "Title for the group of friends who have sent offers of access to their Internet, which the user have not yet accepted."
  },
  "requests": {
    "message": "Demandes",
    "description": "Title for the group of friends who have sent requests to access the user's Internet, which the user have not yet granted."
  },
  "friendsWhoShare": {
    "message": "Amis, vous pourrez obtenir un accès à partir de",
    "description": "Title for the group of friends who the user can get Internet access from."
  },
  "friendsWhoCanGet": {
    "message": "Amis qui peuvent obtenir l'accès de vous",
    "description": "Title for the group of friends who can access the Internet through the user."
  },
  "uproxyFriends": {
    "message": "Amis qui ont uProxy",
    "description": "Title for the group of friends who have uProxy but who don't fit into any of the other contact groups."
  },
  "connectedWith": {
    "message": "Connecté avec __network__",
    "description": "Text in settings that informs the user which social network they're connected to."
  },
  "nameThisDevice": {
    "message": "Nommez ce dispositif",
    "description": "If the user has not named their device (e.g. 'laptop' or 'home computer'), they will see this message in the Settings panel."
  },
  "deviceDescription": {
    "message": "Description de l'appareil",
    "description": "Title for the section in Settings where the user can edit the name of their device."
  },
  "description": {
    "message": "Description",
    "description": "Placeholder for the input field for the name of the user's device."
  },
  "save": {
    "message": "Sauvegarder",
    "description": "Label for button that saves the user's text input."
  },
  "restart": {
    "message": "Redémarrage",
    "description": "Restart uProxy completely."
  },
  "advancedSettings": {
    "message": "Paramètres Avancés",
    "description": "Clickable text from the Settings menu. Clicking this opens the advanced settings screen."
  },
  "advancedSettings_sentenceCase": {
    "message": "Paramètres avancés",
    "description": "Title for the advanced settings screen."
  },
  "editAdvancedSettings": {
    "message": "Modifier vos paramètres ci-dessous",
    "description": "Instruction for the user to edit their advanced settings (by typing JSON in a textbox)."
  },
  "editAdvancedSettingsPlaceholder": {
    "message": "Modifiez vos paramètres",
    "description": "Default text in the advanced settings textbox."
  },
  "settingsSaved": {
    "message": "Paramètres sauvegardés",
    "description": "Message that confirms to the user that their advanced settings were saved."
  },
  "settingsBadFormatError": {
    "message": "Impossible de définir: format incorrect",
    "description": "Error shown to the user if their input for advanced settings is badly formed JSON."
  },
  "settingsJsonError": {
    "message": "Impossible de définir: JSON valeur décalage",
    "description": "Error shown to the user if their input for advanced settings is incomplete or incompatible with expected settings configurations."
  },
  "set": {
    "message": "SET",
    "description": "Label for button that saves the user's advanced settings."
  },
  "aboutUproxy": {
    "message": "uProxy vous permet de partager votre accès à Internet ou à avoir accès à Internet à des amis",
    "description": "Description on uProxy's introduction screen explaining what uProxy is."
  },
  "next": {
    "message": "Suivant",
    "description": "Label for button that proceeds from the introduction page to the login page."
  },
  "learnMoreUproxy": {
    "message": "En savoir plus sur uProxy",
    "description": "Label for button that brings user to more information about uProxy."
  },
  "whichSocialNetwork": {
    "message": "Où pouvez-vous trouver vos contacts le plus rapide?",
    "description": "Question seen at the top of uProxy's login page. Asks which social network should be used to find the user's friends."
  },
  "whySocialNetwork": {
    "message": "uProxy utilise les réseaux sociaux pour vous aider à configurer les connexions avec vos amis",
    "description": "Explains why uProxy needs social networks. (Friends need to login with the same social network on uProxy for friends to see each other.)"
  },
  "setUpOneTime": {
    "message": "Configurer une connexion unique",
    "description": "Clickable link on the login page. As an alternative to logging in to a social network, user's can attempt a connection with a one-time link."
  },
  "weWontPost": {
    "message": "Nous ne communiquerons pas vos données ou afficher publiquement sans votre consentement",
    "description": "Inform the user that uProxy does not share data or post to their social network accounts without agreement from the user."
  },
  "learnMoreSocial": {
    "message": "En savoir plus sur les réseaux sociaux",
    "description": "Label for button that brings user to more information about why social networks are used for uProxy."
  },
  "askToAnalyze": {
    "message": "Il se pourrait que le type de NAT de votre réseau est incompatible avec uProxy. Aimeriez-vous uProxy pour analyser votre réseau?",
    "description": "Text in a popup that appears when an attempt to access the Internet through a friend fails."
  },
  "analyzingNetwork": {
    "message": "réseau Analyse",
    "description": "Message shown when the user's network is being analyzed."
  },
  "analysisResults": {
    "message": "Il semble que vous êtes sur un __natType__, qui est __natImpact__ interfère avec votre capacité à se connecter à vos amis.",
    "description": "A summary of the user's network analysis."
  },
  "moreInfo": {
    "message": "Plus d'informations",
    "description": "Link to 'Does uProxy log data about me?' question in the FAQ."
  },
  "askToSubmitAnalysis": {
    "message": "Souhaitez-vous présenter votre type de NAT à l'équipe uProxy, pour nous aider à mieux comprendre les réseaux de nos utilisateurs sont sur?",
    "description": "Asks the user if they are willing to share their network analysis results with uProxy, to help the development of uProxy."
  },
  "veryLikely": {
    "message": "très probable",
    "description": "Meaning high probability. Used in context of the probability that network settings are preventing a uProxy connection from being established."
  },
  "possibly": {
    "message": "peut-être",
    "description": "Meaning medium probability. Used in context of the probability that network settings are preventing a uProxy connection from being established."
  },
  "unlikely": {
    "message": "improbable",
    "description": "Meaning very low probability. Used in context of the probability that network settings are preventing a uProxy connection from being established."
  },
  "privacyPolicy": {
    "message": "Politique de confidentialité",
    "description": "Link to uProxy's privacy policy."
  },
  "startedProxying": {
    "message": "__name__ commencé proxy à travers vous",
    "description": "Notification for when a friend has started accessing the Internet through the user."
  },
  "stoppedProxying": {
    "message": "__name__ arrêté le mandatement à travers vous",
    "description": "Notification for when a friend has stopped accessing the Internet through the user."
  },
  "unableToShareWith": {
    "message": "Impossible de partager l'accès avec __name__",
    "description": "Error message seen in uProxy when a friend failed to get access to the Internet through the user."
  },
  "unableToGetFrom": {
    "message": "Impossible d'obtenir l'accès à partir __name__",
    "description": "Error message seen in uProxy when the user failed to get access to the Internet through a friend."
  },
  "gettingAccessFrom": {
    "message": "Obtenir l'accès à partir __name__",
    "description": "Message in a status bar that is visible when the user is getting access from a friend."
  },
  "sharingAccessWith_one": {
    "message": "Partager l'accès avec __name__",
    "description": "Message in a status bar that is visible when one friend is getting access through the user."
  },
  "sharingAccessWith_two": {
    "message": "Partager l'accès avec __name1__ et __name2__",
    "description": "Message in a status bar that is visible when two friends are getting access through the user."
  },
  "sharingAccessWith_many": {
    "message": "Partager l'accès avec __name__ et __numOthers__ autres",
    "description": "Message in a status bar that is visible when three or more friends are getting access through the user."
  },
  "loggedOut": {
    "message": "Vous avez été déconnecté de __network__",
    "description": "Notification for when the user has been logged out of the social network."
  },
  "grantedAccessNotification": {
    "message": "__name__ accordée vous accès",
    "description": "Notification for when a user's request to access the Internet through a friend has been accepted by that friend."
  },
  "offeredAccessNotification": {
    "message": "__name__ offert vous accès",
    "description": "Notification for when the user receives an offer from a friend to access the Internet through them."
  },
  "acceptedOfferNotification": {
    "message": "__name__ a accepté votre offre d'accès",
    "description": "Notification for when a friend has accepted the user's offer to share their Internet with that friend."
  },
  "requestingAccessNotification": {
    "message": "__name__ est une demande d'accès",
    "description": "Notification for when a friend sends a request to access the Internet through the user."
  },
  "descriptionDefault": {
    "message": "__number__ informatique",
    "description": "If a friend has more than one computer, the computers are given this default name (with increasing numbers) to differentiate them."
  },
  "language": {
    "message": "Langue",
    "description": "Language used by the application."
  },
  "selectLanguage": {
    "message": "Sélectionnez une langue",
    "description": "Instruction to select language used by the application."
  },
  "extMissingTitle": {
    "message": "Vous êtes presque prêt à utiliser uProxy!",
    "description": "Shown in Chrome if the user has not finished installing both parts of uProxy."
  },
  "extMissingMessage": {
    "message": "Téléchargez et activer la partie 1 de uProxy pour commencer.",
    "description": "Shown in Chrome to instruct the user to install part 1 of uProxy."
  },
  "appMissingTitle": {
    "message": "Vous êtes presque prêt à utiliser uProxy!",
    "description": "Shown in Chrome if the user has not finished installing both parts of uProxy."
  },
  "appMissingMessage": {
    "message": "Téléchargez et activer la partie 2 de uProxy pour commencer.",
    "description": "Shown in Chrome to instruct the user to install part 2 of uProxy."
  }
}
