{
  "DONE": {
    "description": "Button label that suggests acknowledgement and that closes a popup.",
    "message": "Done"
  },
  "YES": {
    "description": "Button label.",
    "message": "Yes"
  },
  "NO": {
    "description": "Button label.",
    "message": "No"
  },
  "OK": {
    "description": "Button label.",
    "message": "OK"
  },
  "CLOSE": {
    "description": "Button label to close a popup.",
    "message": "Close"
  },
  "CONTINUE": {
    "description": "Button label.",
    "message": "Continue"
  },
  "CANCEL": {
    "description": "Button label that rejects a proposed action.",
    "message": "Cancel"
  },
  "START_GETTING": {
    "description": "Start accessing the Internet through a friend's connection.",
    "message": "Start getting access"
  },
  "STOP_GETTING": {
    "description": "Stop accessing the Internet through a friend's connection.",
    "message": "Stop getting access"
  },
  "SUBMIT_FEEDBACK": {
    "description": "Submit feedback to the uProxy team.",
    "message": "Submit Feedback"
  },
  "SENDING_FEEDBACK": {
    "description": "Message in dialog indicating feedback is being sent to the uProxy team.",
    "message": "Sending feedback"
  },
  "GET_HELP": {
    "description": "Get help from the frequently asked questions page.",
    "message": "Get Help"
  },
  "LOGOUT": {
    "description": "Log-out of uProxy.",
    "message": "Log-out of uProxy"
  },
  "ONLINE": {
    "description": "Shown under your contact's who are online",
    "message": "Online"
  },
  "OFFLINE": {
    "description": "Shown under your contact's who are offline",
    "message": "Offline"
  },
  "RESPOND_TO_FRIEND_REQUEST": {
    "description": "Shown in roster under contacts who have requested to be the user's uProxy friend.",
    "message": "Respond to friend request"
  },
  "FRIEND_REQUEST_SENT": {
    "description": "Shown in roster under contacts who the user has requested to be a uProxy friend.",
    "message": "Friend request sent"
  },
  "FRIEND_REQUEST": {
    "description": "Message above button for user to accept a uProxy friend request",
    "message": "Your friend __name__ would like to use uProxy with you!"
  },
  "ACCEPT_INVITE": {
    "description": "Text for button for user to accept a uProxy friend request",
    "message": "Accept Invite"
  },
  "TRYING_TO_CONNECT": {
    "description": "The user is trying to connect to the Internet through their friend.",
    "message": "Trying to connect to __name__"
  },
  "ASKING_FOR_ACCESS": {
    "description": "The user is asking for permission to access the Internet through their friend; user is waiting for the friend's reply.",
    "message": "Asking for access"
  },
  "WAITING_FOR_ACCESS": {
    "description": "User will be able to access the Internet through their friend, once that friend gives the user permission.",
    "message": "You will be able to get access when __name__ accepts."
  },
  "CANCEL_REQUEST": {
    "description": "Label for button which will take back a request to get Internet access through a friend.",
    "message": "Cancel Request"
  },
  "OFFERED_YOU_ACCESS": {
    "description": "A friend has offered their Internet access to the user.",
    "message": "They've offered you access."
  },
  "ACCEPT_OFFER": {
    "description": "Accept a friend's offer that would allow the user to access the Internet through their friend.",
    "message": "Accept Offer"
  },
  "IGNORE": {
    "description": "Button label that ignores an offer or request.",
    "message": "Ignore"
  },
  "STOP_IGNORING_OFFERS": {
    "description": "Button label for if the user wants to stop ignoring offers.",
    "message": "Stop ignoring offers"
  },
  "ASK_FOR_ACCESS": {
    "description": "Button label that sends a request to the user's friend, asking if the user can access the Internet through them.",
    "message": "Ask for access"
  },
  "FRIEND_OFFLINE": {
    "description": "Message shown when trying to get access from a friend who is offline.",
    "message": "__name__ is offline"
  },
  "REVOKE_ACCESS": {
    "description": "Label for button that takes back an offer to a friend who has already accepted that offer. If the button is clicked, the friend will no longer be able to connect to the Internet through the user.",
    "message": "Revoke Access"
  },
  "CANCEL_OFFER": {
    "description": "Label for button that takes back an offer to a friend who has not yet accepted that offer. If the button is clicked, the friend will no longer be able to connect to the Internet through the user.",
    "message": "Cancel Offer"
  },
  "FRIEND_REQUESTS_ACCESS": {
    "description": "A friend has requested to access the Internet through the user.",
    "message": "__name__ requests access from you."
  },
  "GRANT": {
    "description": "Label for button that accepts a friend's request to access the Internet through the user.",
    "message": "Grant"
  },
  "FRIEND_REQUESTED_ACCESS": {
    "description": "A friend has requested to access the Internet through the user.",
    "message": "They requested access through you."
  },
  "STOP_IGNORING_REQUESTS": {
    "description": "Button label for if the user wants to stop ignoring requests.",
    "message": "Stop ignoring requests"
  },
  "ACCESS_NOT_GRANTED": {
    "description": "The user has not permissioned a friend to access the Internet through the user.",
    "message": "You have not granted them access."
  },
  "OFFER_ACCESS": {
    "description": "Label for button that will offer a friend access to the Internet through the user, even though the friend has not requested access.",
    "message": "Offer Access"
  },
  "SUBMIT_FEEDBACK_SENTENCE_CASE": {
    "description": "Submit feedback to the uProxy team.",
    "message": "Submit feedback"
  },
  "EMAIL_TITLE": {
    "description": "",
    "message": "Email (optional)"
  },
  "EMAIL_PLACEHOLDER": {
    "description": "",
    "message": "Email address"
  },
  "FEEDBACK_TITLE": {
    "description": "Label for textbox for user's to submit feedback and comments to uProxy.",
    "message": "Enter your feedback below"
  },
  "FEEDBACK_PLACEHOLDER": {
    "description": "The default text that appears in the user feedback textbox.",
    "message": "Write your feedback"
  },
  "FEEDBACK_ERROR_PLACEHOLDER": {
    "description": "Error that apears if you try to submit an empty feedback.",
    "message": "Please enter some feedback"
  },
  "NETWORK_AND_LOGS": {
    "description": "Label for a checkbox that indicates if the user wants uProxy to analyze their network settings and include their uProxy logs with their feedback to the uProxy team.",
    "message": "Analyze network and include logs"
  },
  "ANALYZE_NAT": {
    "description": "The text for a button in the settings pane the user can click to check their NAT settings and view the latest logs uProxy has collected",
    "message": "Analyze NAT"
  },
  "P_I_I_MESSAGE": {
    "description": "Message helping make sure the user understands that personally identifiable information may be included in their feedback to uProxy.",
    "message": "Your feedback and email address will be sent to uProxy.org. Your logs, network information and email may include personally identifiable information."
  },
  "THANK_YOU": {
    "description": "",
    "message": "Thank you!"
  },
  "FEEDBACK_SUBMITTED": {
    "description": "User feedback was successfully submitted.",
    "message": "Your feedback has been submitted to the uProxy development team."
  },
  "EMAIL_INSTEAD_TITLE": {
    "description": "Title for error that appears if feedback submission failed.",
    "message": "Email feedback instead?"
  },
  "EMAIL_INSTEAD_MESSAGE": {
    "description": "Seen if feedback submission through uProxy fails. Message asks users to email their feedback instead.",
    "message": "Oops! We were unable to submit your feedback to uproxy.org. Please copy and paste your feedback in an email to info@uproxy.org."
  },
  "LOGS_TITLE": {
    "description": "Title for the page that displays a user's network information and uProxy logs.",
    "message": "Logs & Network Analysis"
  },
  "TO_SEND_LOGS": {
    "description": "Instructions guiding the user through how to submit their logs to uProxy.",
    "message": "To send your logs to the uProxy team for help, open uProxy and click 'Submit Feedback'"
  },
  "RETRIEVING_LOGS": {
    "description": "Message shown while uProxy is analyzing the user's network settings.",
    "message": "Retrieving logs and analyzing your network..."
  },
  "ERROR_SIGNING_IN": {
    "description": "Notification for when the user could not be signed in to a social network.",
    "message": "There was a problem signing in to __network__.  Please try again."
  },
  "ATTEMPTING_RECONNECT": {
    "description": "uProxy was disconnected from the social network and is trying to reconnect.",
    "message": "Attempting to re-connect."
  },
  "STATS_ENABLED_TITLE": {
    "description": "The user has elected to submit anonymous statistics about their uProxy usage to the uProxy team.",
    "message": "Anonymous stats enabled"
  },
  "STATS_ENABLED_TOOLTIP": {
    "description": "Text that appears in a tooltip when the user hovers over the 'anonymous stats enabled' icon.",
    "message": "You are sharing anonymous stats."
  },
  "SHARING_ENABLED_TITLE": {
    "description": "Title for popup that points to the sharing icon in uProxy's top toolbar. The popup appears when the user first grants access to one of their friends. The sharing icon is visible as long as there are friends who can get access to the user's Internet.",
    "message": "Sharing Enabled"
  },
  "SHARING_ENABLED_MESSAGE": {
    "description": "Text in a popup that explains what the sharing icon (on the toolbar) is.",
    "message": "This icon means you're available for sharing access with friends you've offered access to."
  },
  "SHARING_ENABLED_TOOLTIP": {
    "description": "Text that appears in a tooltip when the user hovers over the sharing icon.",
    "message": "You are available for sharing."
  },
  "GET_ACCESS": {
    "description": "Text for the tab on the toolbar. When the user is on the 'Get Access' tab, they are looking to get access to the Internet through a friend.",
    "message": "Get Access"
  },
  "SHARE_ACCESS": {
    "description": "Text for the tab on the toolbar. When the user is on the 'Share Access' tab, they are looking to share access to their Internet with a friend.",
    "message": "Share Access"
  },
  "WELCOME": {
    "description": "",
    "message": "Welcome to uProxy"
  },
  "BETA_MESSAGE": {
    "description": "Text in a popup that appears wen the user first uses uProxy. Explains that the current version of uProxy is an early, unfinished release, and anonymous statistics (from the user, if they choose) can help with uProxy's development.",
    "message": "This is a beta release of uProxy, and it may occasionally be unreliable."
  },
  "MORE_ABOUT_METRICS": {
    "description": "",
    "message": "Learn more about anonymous metrics"
  },
  "CHANGE_STATS_CHOICE": {
    "description": "Informs the user that they can opt in and out of sending anonymous statistics at any time they choose, from the Settings menu.",
    "message": "You can help us make uProxy better by sharing anonymous metrics. All data is anonymized by the client and transmitted securely."
  },
  "ENABLE_METRICS": {
    "description": "Asks the user if they want to send anonymous metrics about their uProxy usage.",
    "message": "Would you like to enable anonymous metrics collection?"
  },
  "IM_IN": {
    "description": "Agree to submitting anonymous metrics to uProxy.",
    "message": "I'm in"
  },
  "NO_THANKS": {
    "description": "Do not agree to submitting anonymous metrics to uProxy.",
    "message": "No thanks"
  },
  "DISCONNECTED_TITLE": {
    "description": "Title for error that appears when the user was getting access to the Internet through their friend, but that connection was terminated.",
    "message": "Oops! You've been disconnected from your friend."
  },
  "DISCONNECTED_MESSAGE": {
    "description": "Instruction informing the user that if they want to browse the Internet and stop waiting for reconnection, the user will need to use their local (potentially unsafe and/or censored) connection.",
    "message": "If you disable the proxy, your web traffic will no longer be routed through your friend. You may want to close any sensitive pages you have open, before proceeding."
  },
  "CONTINUE_BROWSING": {
    "description": "Label for button that will change the users Internet settings back to using the user's local connection (i.e. not their friend's Internet).",
    "message": "Continue Browsing Without uProxy"
  },
  "SHARING_UNAVAILABLE_TITLE": {
    "description": "Title for error that appears when the user can not share their Internet access with friends.",
    "message": "Sharing Unavailable"
  },
  "SHARING_UNAVAILABLE_MESSAGE": {
    "description": "Text for error that appears when the user can not share their Internet access with friends.",
    "message": "Oops! You're using Firefox 37, which has a bug that prevents sharing from working (see git.io/vf5x1). This bug is fixed in Firefox 38, so you can enable sharing by upgrading Firefox or switching to Chrome."
  },
  "LOADING_FRIENDS": {
    "description": "User's friends are being loaded from a social network.",
    "message": "Loading uProxy friends"
  },
  "OFFERS": {
    "description": "Title for the group of friends who have sent offers of access to their Internet, which the user have not yet accepted.",
    "message": "Offers"
  },
  "REQUESTS": {
    "description": "Title for the group of friends who have sent requests to access the user's Internet, which the user have not yet granted.",
    "message": "Requests"
  },
  "FRIENDS_WHO_SHARE": {
    "description": "Title for the group of friends who the user can get Internet access from.",
    "message": "Friends you can get access from"
  },
  "FRIENDS_WHO_CAN_GET": {
    "description": "Title for the group of friends who can access the Internet through the user.",
    "message": "Friends who can get access from you"
  },
  "UPROXY_FRIENDS": {
    "description": "Title for the group of friends who have uProxy but who don't fit into any of the other contact groups.",
    "message": "Friends who have uProxy"
  },
  "NOT_CONNECTED_LOGIN_TO_START": {
    "description": "Text in settings that informs the user they should sign in to a social network to get started.",
    "message": "Login to get started"
  },
  "CONNECTED_WITH": {
    "description": "Text in settings that informs the user which social network they're connected to.",
    "message": "Connected with __network__"
  },
  "CONNECTED_WITH_NUMBER": {
    "description": "Text in settings informing the user of how many networks they're connected to.",
    "message": "Connected with __number__ networks"
  },
  "NAME_THIS_DEVICE": {
    "description": "If the user has not named their device (e.g. 'laptop' or 'home computer'), they will see this message in the Settings panel.",
    "message": "Name this device"
  },
  "DEVICE_DESCRIPTION": {
    "description": "Title for the section in Settings where the user can edit the name of their device.",
    "message": "Device description"
  },
  "DESCRIPTION": {
    "description": "Placeholder for the input field for the name of the user's device.",
    "message": "Description"
  },
  "CONNECTED_ACCOUNTS": {
    "description": "In settings, title for the social networks you can connect to.",
    "message": "Connected Accounts"
  },
  "CONNECT": {
    "description": "User clicks this to connect to a network",
    "message": "Connect"
  },
  "DISCONNECT": {
    "description": "User clicks this to disconnect from a network",
    "message": "Disconnect"
  },
  "SAVE": {
    "description": "Label for button that saves the user's text input.",
    "message": "Save"
  },
  "RESTART": {
    "description": "Restart uProxy completely.",
    "message": "Restart"
  },
  "ADVANCED_SETTINGS": {
    "description": "Clickable text from the Settings menu. Clicking this opens the advanced settings screen.",
    "message": "Advanced Settings"
  },
  "ADVANCED_SETTINGS_SENTENCE_CASE": {
    "description": "Title for the advanced settings screen.",
    "message": "Advanced settings"
  },
  "EDIT_ADVANCED_SETTINGS": {
    "description": "Instruction for the user to edit their advanced settings (by typing JSON in a textbox).",
    "message": "Edit your settings below"
  },
  "EDIT_ADVANCED_SETTINGS_PLACEHOLDER": {
    "description": "Default text in the advanced settings textbox.",
    "message": "Edit your settings"
  },
  "SETTINGS_SAVED": {
    "description": "Message that confirms to the user that their advanced settings were saved.",
    "message": "Settings saved"
  },
  "SETTINGS_BAD_FORMAT_ERROR": {
    "description": "Error shown to the user if their input for advanced settings is badly formed JSON.",
    "message": "Could not set: bad format"
  },
  "SETTINGS_JSON_ERROR": {
    "description": "Error shown to the user if their input for advanced settings is incomplete or incompatible with expected settings configurations.",
    "message": "Could not set: JSON value mismatch"
  },
  "SET": {
    "description": "Label for button that saves the user's advanced settings.",
    "message": "SET"
  },
  "ABOUT_UPROXY": {
    "description": "Description on uProxy's introduction screen explaining what uProxy is.",
    "message": "uProxy helps you get and share access to the internet with friends or through a secure cloud connection."
  },
  "NEXT": {
    "description": "Label for button that proceeds from the introduction page to the login page.",
    "message": "Next"
  },
  "LEARN_MORE_UPROXY": {
    "description": "Label for button that brings user to more information about uProxy.",
    "message": "Learn more about uProxy"
  },
  "WHICH_SOCIAL_NETWORK": {
    "description": "Question seen at the top of uProxy's login page. Asks which social network should be used to find the user's friends.",
    "message": "Where can you find your contacts the quickest?"
  },
  "WHY_SOCIAL_NETWORK": {
    "description": "Explains why uProxy needs social networks. (Friends need to login with the same social network on uProxy for friends to see each other.)",
    "message": "uProxy uses social networks to help you set up connections with your friends"
  },
  "WE_WONT_POST": {
    "description": "Inform the user that uProxy does not share data or post to their social network accounts without agreement from the user.",
    "message": "We won't share your data or post publicly without your consent"
  },
  "WE_WONT_POST_LEARN_MORE": {
    "description": "Inform the user that uProxy does not share data or post to their social network accounts without agreement from the user.",
    "message": "We won't share your data or post publicly without your consent. <uproxy-faq-link anchor='whyDoesUproxyConnect'>Learn more</uproxy-faq-link>"
  },
  "HAVE_AN_INVITE_CODE": {
    "description": "Text above a button that asks the user if they already have a uProxy invite code",
    "message": "Have an invite code?"
  },
  "ENTER_IT_HERE": {
    "description": "Text for button that opens a view for the user to enter their uProxy invite code",
    "message": "Enter it here"
  },
  "LEARN_MORE_SOCIAL": {
    "description": "Label for button that brings user to more information about why social networks are used for uProxy.",
    "message": "Learn more about social networks"
  },
  "EXPERIMENTAL": {
    "description": "Label below social networks (on the login page) indicating that a social network is experimental.",
    "message": "Experimental"
  },
  "ASK_TO_ANALYZE": {
    "description": "Text in a popup that appears when an attempt to access the Internet through a friend fails.",
    "message": "It could be that your network's NAT type is incompatible with uProxy. Would you like uProxy to analyze your network?"
  },
  "UNABLE_TO_GET": {
    "description": "Title for popup that appears when an attempt to access the Internet through a friend fails.",
    "message": "Unable to get access"
  },
  "UNABLE_TO_SHARE": {
    "description": "Title for popup that appears when an attempt to share the Internet with a friend fails.",
    "message": "Unable to share access"
  },
  "ANALYZING_NETWORK": {
    "description": "Message shown when the user's network is being analyzed.",
    "message": "Analyzing network"
  },
  "ANALYSIS_RESULTS": {
    "description": "A summary of the user's network analysis.",
    "message": "It looks like you are on a __natType__, which is __natImpact__ interfering with your ability to connect to friends."
  },
  "MORE_INFO": {
    "description": "Link to 'Does uProxy log data about me?' question in the FAQ.",
    "message": "More info"
  },
  "ASK_TO_SUBMIT_ANALYSIS": {
    "description": "Asks the user if they are willing to share their network analysis results with uProxy, to help the development of uProxy.",
    "message": "Would you like to submit your NAT type to the uProxy team, to help us better understand the networks our users are on?"
  },
  "VERY_LIKELY": {
    "description": "Meaning high probability. Used in context of the probability that network settings are preventing a uProxy connection from being established. Used in analysisResults string.",
    "message": "most likely"
  },
  "POSSIBLY": {
    "description": "Meaning medium probability. Used in context of the probability that network settings are preventing a uProxy connection from being established. Used in analysisResults string.",
    "message": "possibly"
  },
  "UNLIKELY": {
    "description": "Meaning very low probability. Used in context of the probability that network settings are preventing a uProxy connection from being established. Used in analysisResults string.",
    "message": "probably not"
  },
  "PRIVACY_POLICY": {
    "description": "Link to uProxy's privacy policy.",
    "message": "Privacy policy"
  },
  "STARTED_PROXYING": {
    "description": "Notification for when a friend has started accessing the Internet through the user.",
    "message": "__name__ started proxying through you"
  },
  "STOPPED_PROXYING": {
    "description": "Notification for when a friend has stopped accessing the Internet through the user.",
    "message": "__name__ stopped proxying through you"
  },
  "UNABLE_TO_SHARE_WITH": {
    "description": "Error message seen in uProxy when a friend failed to get access to the Internet through the user.",
    "message": "Unable to share access with __name__"
  },
  "UNABLE_TO_GET_FROM": {
    "description": "Error message seen in uProxy when the user failed to get access to the Internet through a friend.",
    "message": "Unable to get access from __name__"
  },
  "GETTING_ACCESS_FROM": {
    "description": "Message in a status bar that is visible when the user is getting access from a friend.",
    "message": "Getting access from __name__"
  },
  "GETTING_ACCESS_FROM_FRIEND": {
    "description": "Message in a status bar that is visible when the user is getting access from a nameless friend",
    "message": "Currently getting access from a friend"
  },
  "SHARING_ACCESS_WITH_ONE": {
    "description": "Message in a status bar that is visible when one friend is getting access through the user.",
    "message": "Sharing access with __name__"
  },
  "SHARING_ACCESS_WITH_TWO": {
    "description": "Message in a status bar that is visible when two friends are getting access through the user.",
    "message": "Sharing access with __name1__ and __name2__"
  },
  "SHARING_ACCESS_WITH_MANY": {
    "description": "Message in a status bar that is visible when three or more friends are getting access through the user.",
    "message": "Sharing access with __name__ and __numOthers__ others"
  },
  "SHARING_ACCESS_WITH_FRIEND": {
    "description": "Message in a status bar that is visible when the user is sharing access with a nameless friend",
    "message": "Currently sharing access with a friend"
  },
  "LOGGED_OUT": {
    "description": "Notification for when the user has been logged out of the social network.",
    "message": "You have been logged out of __network__"
  },
  "GRANTED_ACCESS_NOTIFICATION": {
    "description": "Notification for when a user's request to access the Internet through a friend has been accepted by that friend.",
    "message": "__name__ granted you access"
  },
  "OFFERED_ACCESS_NOTIFICATION": {
    "description": "Notification for when the user receives an offer from a friend to access the Internet through them.",
    "message": "__name__ offered you access"
  },
  "ACCEPTED_OFFER_NOTIFICATION": {
    "description": "Notification for when a friend has accepted the user's offer to share their Internet with that friend.",
    "message": "__name__ has accepted your offer for access"
  },
  "REQUESTING_ACCESS_NOTIFICATION": {
    "description": "Notification for when a friend sends a request to access the Internet through the user.",
    "message": "__name__ is requesting access"
  },
  "DESCRIPTION_DEFAULT": {
    "description": "If a friend has more than one computer, the computers are given this default name (with increasing numbers) to differentiate them.",
    "message": "Computer __number__"
  },
  "LANGUAGE": {
    "description": "Language used by the application.",
    "message": "Language"
  },
  "SELECT_LANGUAGE": {
    "description": "Instruction to select language used by the application.",
    "message": "Select a language"
  },
  "EXT_MISSING_TITLE": {
    "description": "Shown in Chrome if the user has not finished installing both parts of uProxy.",
    "message": "You're almost ready to use uProxy!"
  },
  "EXT_MISSING_MESSAGE": {
    "description": "Shown in Chrome to instruct the user to install part 1 of uProxy.",
    "message": "Download and enable part 1 of uProxy to get started."
  },
  "APP_MISSING_TITLE": {
    "description": "Shown in Chrome if the user has not finished installing both parts of uProxy.",
    "message": "You're almost ready to use uProxy!"
  },
  "APP_MISSING_MESSAGE": {
    "description": "Shown in Chrome to instruct the user to install part 2 of uProxy.",
    "message": "Download and enable part 2 of uProxy to get started."
  },
  "RECONNECTING": {
    "description": "Indicate that uProxy is attempting to reconnect automatically after a failure.  A progress indicator is also visible.",
    "message": "Reconnecting..."
  },
  "RECONNECT_FAILED": {
    "description": "Indicate that uProxy attempted to reconnect automatically but it failed.",
    "message": "Reconnect failed"
  },
  "RESTART_PROXYING": {
    "description": "Displayed on a button next to the RECONNECT_FAILED message",
    "message": "Try again"
  },
  "UPDATE_AVAILABLE": {
    "description": "What to show the user (on the bottom bar) when an update is available.  The actual update will not be done until they restart uProxy which we will prompt them to do with a link.",
    "message": "An update is available"
  },
  "RESTART_UPROXY_UPDATE": {
    "description": "A link the user can click on to restart uProxy and permorm an update",
    "message": "Restart to update"
  },
  "PORT_CONTROL_TITLE": {
    "description": "Title for the port control section in advanced settings",
    "message": "Port control status"
  },
  "PORT_CONTROL_SUPPORTED": {
    "description": "NAT-PMP, PCP, or UPnP is supported in the router",
    "message": "Your router has port control enabled."
  },
  "PORT_CONTROL_NOT_SUPPORTED": {
    "description": "NAT-PMP, PCP, and UPnP are not supported in the router",
    "message": "Your router does not have port control enabled."
  },
  "PORT_CONTROL_PENDING": {
    "description": "uProxy is currently probing router for port control support",
    "message": "Probing router for port control support..."
  },
  "PORT_CONTROL_NOT_SUPPORTED_INFO": {
    "description": "Extra information displayed when port control is not supported",
    "message": "You may be able to enable port control to make uProxy more reliable."
  },
  "PORT_CONTROL_NOT_SUPPORTED_INFO_LINK": {
    "description": "Link text right after the PORT_CONTROL_NOT_SUPPORTED_INFO text",
    "message": "More info."
  },
  "LEARN_MORE": {
    "description": "Generic label for links to FAQ.",
    "message": "Learn more"
  },
  "FRIEND_ADDED": {
    "description": "Confirmation message after adding a friend to the roster.",
    "message": "Friend added"
  },
  "FRIEND_ADD_ERROR": {
    "description": "Error message when a friend cannot be added to the roster.",
    "message": "There was an error adding your friend."
  },
  "INVITE_EMAIL_SENT": {
    "description": "Confirmation message after an invite email has been sent",
    "message": "Invitation email sent."
  },
  "ENTER_INVITATION": {
    "description": "Title for screen where user enters an invitation",
    "message": "Enter an invitation"
  },
  "ENTER_INVITATION_DESCRIPTION": {
    "description": "Instructions for user to enter an invitation",
    "message": "If you've received an invitation from a friend you'd like to use uProxy with, paste it here:"
  },
  "SUBMIT_BUTTON_TEXT": {
    "description": "Button that submits some data entered by the user, e.g. entering a friend invite",
    "message": "Submit"
  },
  "INVITE_LINK_FROM_ACCEPT_PAGE": {
    "description": "Link to send an invite if the user is already on the accept-invite page.",
    "message": "I'd like to send an invitation instead."
  },
  "INVITE_A_FRIEND": {
    "description": "Title for screen where user invites a friend to uProxy",
    "message": "Invite a friend"
  },
  "HOW_TO_INVITE_FRIENDS": {
    "description": "Question above network select dropdown on invite screen",
    "message": "How would you like to invite to your friends?"
  },
  "FIND_YOUR_FRIENDS_ON_A_SOCIAL_NETWORK": {
    "description": "Title above social network icons on the page to find and/or invite friends.",
    "message": "Find your friends on a social network."
  },
  "FACEBOOK_INVITE_INSTRUCTIONS": {
    "description": "Invite instructions for Facebook",
    "message": "Click below to send a uProxy invite to your Facebook friends.  When they open this link with uProxy, they will appear in your uProxy contact list."
  },
  "GMAIL_INVITE_INSTRUCTIONS": {
    "description": "Invite instructions for GMail",
    "message": "Enter your friend's email address to send them a friend request by email.  When they accept the invitation, they will appear on your contact list."
  },
  "GITHUB_INVITE_INSTRUCTIONS": {
    "description": "Invite instructions for GitHub",
    "message": "Enter your friend's GitHub username. You will see in your contact list when they accept your request."
  },
  "GITHUB_INVITE_PLACEHOLDER": {
    "description": "Placeholder in input box for the GitHub username of the friend the user is inviting",
    "message": "Friend's GitHub username"
  },
  "QUIVER_INVITE_INSTRUCTIONS": {
    "description": "Invite instructions for the uProxy Network (aka Quiver)",
    "message": "Generate a link and send it to your friends so they can find you on uProxy.  You can request access, offer access or both."
  },
  "NETWORK_LIST_CLOUD_LABEL": {
    "message": "Create a private cloud server"
  },
  "ADD_A_CLOUD_FRIEND": {
    "description": "Title for screen where user adds a Cloud instance (virtual machine) to use uProxy with",
    "message": "Add a Cloud friend"
  },
  "ADD_CLOUD_INSTRUCTIONS": {
    "description": "If the user is trying to add a Cloud friend, instruct them to click on the link to enter an invitation.",
    "message": "If you have a Cloud invitation code, please click on the link below and enter your invitation on the destination page."
  },
  "CLOUD_INVITE_INSTRUCTIONS": {
    "description": "Invite instructions for Cloud",
    "message": "Enter your invite code. When a connection has been made, it will appear in your contact list."
  },
  "CLOUD_INVITE_PLACEHOLDER": {
    "description": "Placeholder in input box for the invite code.",
    "message": "Invite code"
  },
  "CLOUD_INVITE_FAILED": {
    "description": "Dialog text informing user that a connection could not be made to their cloud instance",
    "message": "Oops, connection failed. Please check the invite code."
  },
  "CLOUD_VIRTUAL_MACHINE": {
    "description": "Refers to a remote server users can proxy from",
    "message": "a virtual machine"
  },
  "CLOUD_INSTALL_STATUS_CREATING_SERVER": {
    "description": "Progress bar label shown during cloud install indicating that a new server is being provisioned.",
    "message": "Creating server..."
  },
  "CLOUD_INSTALL_STATUS_LOGGING_IN": {
    "description": "Progress bar label shown during cloud install indicating that we are logging into the newly created server.",
    "message": "Logging into new server..."
  },
  "CLOUD_INSTALL_STATUS_INSTALLING_DOCKER": {
    "description": "Progress bar label shown during cloud install indicating that we are installing Docker, a pre-requisite.",
    "message": "Installing Docker..."
  },
  "CLOUD_INSTALL_STATUS_DOWNLOADING_INSTALL_SCRIPTS": {
    "description": "Progress bar label shown during cloud install indicating that we are downloading scripts which will install uProxy.",
    "message": "Downloading install scripts..."
  },
  "CLOUD_INSTALL_STATUS_INSTALLING_UPROXY": {
    "description": "Progress bar label shown during cloud install indicating that we are downloading a Docker image for uProxy.",
    "message": "Downloading and installing uProxy image..."
  },
  "CLOUD_INSTALL_STATUS_WAITING_FOR_UPROXY": {
    "description": "Progress bar label shown during cloud install indicating that we are waiting for uProxy to start.",
    "message": "Waiting for uProxy to start..."
  },
  "CLOUD_INSTALL_STATUS_INSTALLING_SSH": {
    "description": "Progress bar label shown during cloud install indicating that we are downloading a Docker image for an SSH server.",
    "message": "Downloading and installing SSH server image..."
  },
  "CLOUD_INSTALL_STATUS_CONFIGURING_SSH": {
    "description": "Progress bar label shown during cloud install indicating that we are configuring SSH.",
    "message": "Configuring SSH..."
  },
  "SEND_INVITATION": {
    "description": "Button text to initiate sending an invitation",
    "message": "Send invitation"
  },
  "SEND_INVITATION_FACEBOOK": {
    "description": "Button text to initiate sending an invitation for Facebook",
    "message": "Invite on Facebook"
  },
  "INVITE_SENT_CONFIRMATION": {
    "description": "Dialog text to confirm that an invite was sent to the user's friend",
    "message": "Invite sent to __name__!"
  },
  "GITHUB_INVITE_SEND_FAILED": {
    "description": "Dialog text informing user that a GitHub friend request failed.",
    "message": "Oops, you can only invite friends who have signed in to uProxy with GitHub before."
  },
  "ACCEPT_LINK_FROM_INVITE_PAGE": {
    "description": "Link to accept an invite if the user is already on the send an invite page",
    "message": "I'd like to enter an invitation instead."
  },
  "ACCEPT_INVITE_CONFIRMATION": {
    "description": "Confirmation message when accepting an invite.",
    "message": "Would you like to add __name__ to your uProxy contacts?"
  },
  "SIGN_IN_TO_NETWORK": {
    "description": "Title for dialog that appears after users choose a social network for finding friends.",
    "message": "Sign in to __network__"
  },
  "SIGN_IN_TO_INVITE_FRIENDS": {
    "description": "Text for dialog that appears if users choose an invite-only social network to find uProxy friends. Text explains that users must sign in before inviting friends.",
    "message": "To invite a __network__ friend to uProxy, please sign in to your __network__ account."
  },
  "LOGIN_REQUIRED_TITLE": {
    "description": "Title for confirmation that the user must login to a network to accept an invitation",
    "message": "Login Required"
  },
  "LOGIN_REQUIRED_MESSAGE": {
    "description": "Message for confirmation that the user must login to a network to accept an invitation",
    "message": "To accept this invitation to connect with __name__, you will need to login to uProxy with __network__.  Click yes to continue."
  },
  "INVITE_ERROR": {
    "description": "Error message shown for invalid invite URLs or tokens",
    "message": "There was an error with your invite."
  },
  "INVITE_EMAIL_SUBJECT": {
    "description": "Default email subject for sending an uProxy invite",
    "message": "Invitation to connect with __name__ on uProxy"
  },
  "INVITE_EMAIL_BODY": {
    "description": "Default email body for sending an uProxy invite",
    "message": "__name__ has invited you to connect with them on uProxy. To do so, click on the invitation link below or paste it into uProxy.<br><br>__url__<br><br>If you don’t have uProxy installed, you can get it from <a href='uproxy.org'>uproxy.org</a> or directly from the Chrome webstore (<a href='https://chrome.google.com/webstore/detail/uproxy-part-1-of-2/pjpcdnccaekokkkeheolmpkfifcbibnj'>part 1</a> and <a href='https://chrome.google.com/webstore/detail/uproxy-part-2-of-2/fmdppkkepalnkeommjadgbhiohihdhii'>part 2</a>) and Firefox Marketplace (<a href='https://addons.mozilla.org/en-US/firefox/addon/uproxy-firefox/'>here</a>)."
  },
  "FAQ_SENTENCE_CASE": {
    "description": "Title of the FAQ window",
    "message": "Get Help"
  },
  "CONFIRM_LOGOUT_FOR_COPYPASTE": {
    "description": "If a user is signed in to social network(s) and attempt to start a one-time connection, this message informs them that they must first log out of all social networks.",
    "message": "To start a one-time connection, you will be logged out of connected social networks. Would you like to log out now?"
  },
  "CONFIRM_LOGOUT_FOR_COPYPASTE_WHILE_PROXYING": {
    "description": "If a user is signed in to social network(s) and is getting or sharing, and attempt to start a one-time connection, this message informs them that they must first log out of all social networks.",
    "message": "To start a one-time connection, you will be logged out of connected social networks and your connections will be stopped.  Would you like to log out now?"
  },
  "CONFIRM_LOGOUT_GETTING_AND_SHARING": {
    "description": "Confirmation when user logs out from a social network while they are getting and sharing access with users on that network",
    "message": "Are you sure you want to log out? You will no longer be getting or sharing access with your friends."
  },
  "CONFIRM_LOGOUT_GETTING": {
    "description": "Confirmation when user logs out from a social network while they are getting access from users on that network",
    "message": "Are you sure you want to log out? You will no longer be getting access from your friend."
  },
  "CONFIRM_LOGOUT_SHARING": {
    "description": "Confirmation when user logs out from a social network while they are sharing access with users on that network",
    "message": "Are you sure you want to log out? You will no longer be sharing access with your friends."
  },
  "WHAT_IS_UPROXY": {
    "description": "FAQ",
    "message": "What is uProxy?"
  },
  "WHAT_IS_UPROXY_ANSWER": {
    "description": "",
    "message": "<p>uProxy is an open source browser extension for Chrome and Firefox that lets users route their internet connection through one another or through private cloud servers. uProxy can make it much harder for a third party (such as the government or an ISP) to monitor or interfere with the traffic of the user who is getting access. It’s like a personalized VPN service that you can use to provide secure access to friends and family, and to yourself when you travel.</p>"
  },
  "WHERE_TO_GET": {
    "description": "FAQ",
    "message": "Where should I get uProxy?"
  },
  "WHERE_TO_GET_ANSWER": {
    "description": "",
    "message": "<p>The easiest way to get uProxy is by going to the <a href=\"install\">Install</a> page. You can also find uProxy in the <a href=\"https://chrome.google.com/webstore/detail/uproxy-part-1-of-2/pjpcdnccaekokkkeheolmpkfifcbibnj\">Chrome Web Store</a> and the <a href=\"https://addons.mozilla.org/en-US/firefox/addon/uproxy-firefox/\">Firefox Add-Ons site</a>. These are the only places you should go to get uProxy. Never download uProxy from anywhere else, as it could be a phony version that could put you at risk.</p>"
  },
  "WHAT_DO_GET_ACCESS": {
    "description": "",
    "message": "What do “get access” and “share access” mean?"
  },
  "WHAT_DO_GET_ACCESS_ANSWER": {
    "description": "",
    "message": "<p>When you are <strong>getting access</strong> from a friend, all the web traffic from your browser first travels encrypted to your friend’s computer and from there, to the Internet. This means that, to most websites, the request will appear to be coming from your friend’s computer, and someone monitoring your connection will only see that you have a secure connection to your friend.</p><p>When you are <strong>sharing access</strong>, authorized friends will be able to send their web traffic to your computer and from there to the Internet. Your friend can only connect through a computer if you authorize them on that computer, and you can revoke their authorization at any time.</p>"
  },
  "WHY_DOES_UPROXY_CONNECT": {
    "description": "",
    "message": "Why does uProxy connect to social networks?"
  },
  "WHY_DOES_UPROXY_CONNECT_ANSWER": {
    "description": "",
    "message": "<p>uProxy needs a way to see when your friends are online, and it needs to exchange information (IP address, port, and encryption keys) between peers to set up direct connections. Instead of operating a central service that could be easily blocked, uProxy connects to social networks that you and your friends are already using. They are only used to help establish a direct connection between users; proxied Internet traffic is not sent through the social network. <strong>uProxy will never post publicly on your behalf.</strong> It only exchanges private messages with friends you choose who are also running uProxy. You can read more about trusting social networks <a href=\"https://github.com/uProxy/uproxy/wiki/Trust\">here</a>.</p>"
  },
  "DOES_UPROXY_LOG_DATA_SHORT": {
    "description": "",
    "message": "Does uProxy collect data about me?"
  },
  "DOES_UPROXY_LOG_DATA": {
    "description": "",
    "message": "Does uProxy log data about me, and what is uProxy’s privacy policy?"
  },
  "DOES_UPROXY_LOG_DATA_ANSWER": {
    "description": "",
    "message": "<p>If you do not opt into uProxy’s data reporting, no data is reported about your usage whatsoever. If you do opt in, any usage data is anonymized before it ever leaves your computer, using the same state-of-the-art, privacy-preserving <a href=\"http://googleresearch.blogspot.com/2014/10/learning-statistics-with-privacy-aided.html\">algorithms</a> used in Google Chrome.</p><p>If you manually use the Submit Feedback tool in the settings menu, you have the option to include logs from your recent uProxy usage. Logs may contain personally identifiable information (PII). PII is never shared outside the uProxy team, and any logs that contain PII are retained for at most three months before being expunged.</p><p>All reports are submitted in a way that makes it hard for an observer of the traffic to detect that you’re using uProxy.</p><p>You can read more about uProxy’s data collection <a href=\"https://github.com/uProxy/uproxy/wiki/Data-Collection\">here</a>.<p>"
  },
  "WHEN_I_AM_SHARING_ACCESS": {
    "description": "",
    "message": "When I’m sharing access with someone, what do they have access to?"
  },
  "WHEN_I_AM_SHARING_ACCESS_ANSWER": {
    "description": "",
    "message": "<p>Users who are getting access from you are only able to use your Internet connection. They cannot look at files on your computer, see what you’re doing on the Internet, or log into websites using your identity. They also cannot access devices on your local home or work network such as a shared printer or file server.</p>"
  },
  "WILL_UPROXY_WORK": {
    "description": "",
    "message": "Where does uProxy work?"
  },
  "WILL_UPROXY_WORK_ANSWER": {
    "description": "",
    "message": "<p>If access is blocked to all of the social networks that uProxy supports, then you will not be able to use a social network to help you set up a connection with your friends. You can still set up a one-time connection manually, by exchanging links generated by uProxy via a secure channel, but you’ll have to repeat this exchange every time you want to connect to your friend. The advantage of using social networks is that connection establishment is automatic, once authorization is granted.</p>"
  },
  "HOW_DO_I_FIND": {
    "description": "",
    "message": "How do I find my friends on uProxy?"
  },
  "HOW_DO_I_FIND_ANSWER": {
    "description": "",
    "message": "<p>You can use the “Connect to a friend” button in the lower right of the contact list to invite friends to proxy with you using one of our supported social networks.</p><p>In order to see when a friend is online, you both have to be logged into uProxy with the same social network at the same time. You can log into multiple social networks simultaneously by going into the menu (the ≡ icon in the top-left) and expanding the header (▾).</p>"
  },
  "WHAT_IS_GITHUB": {
    "message": "What is GitHub and how can I use it?"
  },
  "WHAT_IS_GITHUB_ANSWER": {
    "message": "<p>GitHub is a site for helping developers share code, but uProxy can use GitHub to share the information needed to set up direct connections between friends, just like it uses social networks. GitHub is more accessible to some users than many social networks, and is free to <a href=\"https://github.com/join\">sign up</a>.</p><p>Please note that it’s possible to tell if a GitHub account is using uProxy. If you already have a GitHub account that you don’t want associated with uProxy, you can create a pseudonymous GitHub account and use that with uProxy instead.</p>"
  },
  "HOW_DOES_UPROXY_HELP": {
    "description": "",
    "message": "How does uProxy help protect my Internet connection?"
  },
  "HOW_DOES_UPROXY_HELP_ANSWER": {
    "description": "",
    "message": "<p>When you use the Internet normally, your Internet service provider (ISP) is able to see which sites you’re visiting, and may try to interfere with your connection by blocking access to some sites, or even tampering with their content. On Wi-Fi networks that don’t require a password, it’s even possible for another user on the network to see which sites you’re visiting, and for sites that are HTTP (and not HTTPS), it’s possible they can see the content of the traffic, too.</p><p>When you’re getting access through uProxy, the connection between you and your friend is encrypted. Your browser’s traffic is sent through that connection, and then out to the Internet from your friend’s computer. While getting access through uProxy, your ISP should not be able to see what sites you’re visiting, and uProxy intentionally makes it difficult for your ISP to identify and block your uProxy traffic.</p>"
  },
  "WHY_IS_IT_IMPORTANT": {
    "description": "",
    "message": "Why is it important that I trust the people I am connecting to?"
  },
  "WHY_IS_IT_IMPORTANT_ANSWER": {
    "description": "",
    "message": "<p>uProxy is designed to help friends who trust one another to share an Internet connection. Connecting to people you don’t trust is risky and not recommended.</p><p>If you get access from someone who is malicious, they may be able to spy on your web browsing and even tamper with your traffic. Besides trusting the person you’re getting access from, you should trust that their Internet connection is secure, too. So if they’re connecting from an unknown public Wi-Fi hotspot that may be insecure, it may be better to wait till they’re connected from a secure network back at home.</p><p>If you share access with someone you don’t know and trust, they may be able to use your connection to engage in illegal activity, and depending on local laws, you may be held legally responsible for facilitating that activity.<p>It’s important to trust anyone you share an Internet connection with, whether a guest on your home Wi-Fi network, or a uProxy friend on the other side of the world.</p>"
  },
  "DOES_UPROXY_GIVE_ME": {
    "description": "",
    "message": "Does uProxy provide anonymous browsing?"
  },
  "DOES_UPROXY_GIVE_ME_ANSWER": {
    "description": "",
    "message": "<p>uProxy is not an anonymity tool; it is useful for concealing your browsing from your ISP, but not for hiding your identity from the sites you visit. A website visited by someone who is getting access via uProxy will see the IP address of the person who is sharing access, and the website may be able to discover the IP address of the uProxy user who is getting access. If you need to hide your identity from the websites you visit, we recommend using the <a href=\"https://www.torproject.org/projects/torbrowser.html\">Tor Browser</a>.</p>"
  },
  "WHAT_ISNT_PROXIED": {
    "description": "",
    "message": "What traffic isn’t proxied, and can uProxy leak information about the sites I visit?"
  },
  "WHAT_ISNT_PROXIED_ANSWER": {
    "description": "",
    "message": "<p>uProxy only proxies traffic for the web browser it is running in, not for other applications. There are some uncommon situations where the browser might make unproxied requests, and some web technologies, notably Flash and WebRTC, are capable of making requests that don’t go through the proxy. The same caveats often apply to VPNs. Users with strong privacy needs are encouraged to consider the <a href=\"https://www.torproject.org/projects/torbrowser.html\">Tor Browser</a>, which is designed specifically to minimize what an observer of your traffic can learn about your activity.</p>"
  },
  "WHO_KNOWS_THAT": {
    "description": "",
    "message": "Who knows that I’m using uProxy?"
  },
  "WHO_KNOWS_THAT_ANSWER": {
    "description": "",
    "message": "<p>Anyone you connect with knows that you’re using uProxy. In addition, if you choose to connect uProxy to a social network such as Facebook, the administrators of the social network can tell that you use uProxy, and your friends on that network who are using uProxy may also be able to tell.</p><p>For users connecting with a Gmail or Facebook account, uProxy uses Firebase, a service operated by Google. The Firebase team, and the uProxy team which administers the uProxy Firebase account, can therefore access information about which accounts are using uProxy.</p><p>If you are concerned about using uProxy with your personal account, create a dedicated pseudonymous account and use that with uProxy instead.</p><p>Note that none of these services ever see what sites or pages you’re visiting while using uProxy. Only a user you’re getting access through would be in a position to monitor your traffic. So again, only get access through friends you trust to share an Internet connection.</p>"
  },
  "DOES_UPROXY_PROTECT": {
    "description": "",
    "message": "Does uProxy protect me from viruses, phishing, or hacking?"
  },
  "DOES_UPROXY_PROTECT_ANSWER": {
    "description": "",
    "message": "<p>uProxy can help protect you from an adversary who is trying to redirect you to a malicious site or otherwise tamper with your traffic. However, uProxy’s primary focus is on enabling users to share access to the open Internet.</p>"
  },
  "WHY_IS_UPROXY_ASKING": {
    "description": "",
    "message": "Why is uProxy asking for these Chrome permissions?"
  },
  "WHY_IS_UPROXY_ASKING_ANSWER": {
    "description": "",
    "message": "<p>When you install uProxy for Chrome, it asks for permission to (1) read and change all your data on the websites you visit, and (2) communicate with cooperating websites. These permissions are necessary for uProxy to route your traffic through your friend’s connection. No data about the websites you visit is ever sent to the uProxy team or the social networks you connect to.</p>"
  },
  "WHAT_IS_PORT_CONTROL": {
    "description": "",
    "message": "What is port control?"
  },
  "WHAT_IS_PORT_CONTROL_ANSWER": {
    "description": "",
    "message": "<p>Network Address Translation (NAT) is typically implemented by routers to allow a single public IP address to be shared by multiple devices on the network. However, this can make it challenging for users to establish direct connections with each other, and some types of NATs (particularly symmetric NATs) can prevent uProxy from successfully establishing connections.</p><p>If your router has port control enabled (UPnP, NAT-PMP, or PCP), uProxy can instruct your router to specifically allow incoming connections from other uProxy users. If either side of a uProxy connection is able to use port control, connections will almost always be successful, regardless of NAT configuration. For information on enabling port control on your router, check your router’s manual or search the web for “(router name) enable UPnP”.</p>"
  },
  "HOW_DOES_UPROXY_COMPARE": {
    "description": "",
    "message": "How does uProxy compare to VPNs?"
  },
  "HOW_DOES_UPROXY_COMPARE_ANSWER": {
    "description": "",
    "message": "<p>uProxy is designed to be trustworthy and resistant to blocking.</p><p>VPN users typically connect to easily-identified servers, and VPN traffic can easily be identified and blocked. In contrast, uProxy users connect to each other rather than to common servers, and uProxy makes its traffic hard to identify and therefore hard to block.</p><p>In addition, VPN services can monitor which websites you visit, and many don’t keep this data private. uProxy users place their trust in their connections through friends, rather than in VPN services they may know little about.</p><p>Besides not knowing what VPNs do with their users’ browsing data, it can also be hard to know and trust VPN client and server software, especially when it’s closed source. In contrast, uProxy is open source, and faces ongoing public scrutiny. Whenever possible, uProxy avoids requiring users to put blind faith in software whose trustworthiness cannot be verified.</p>"
  },
  "WHO_MADE_UPROXY": {
    "description": "",
    "message": "Who is developing uProxy?"
  },
  "WHO_MADE_UPROXY_ANSWER": {
    "description": "",
    "message": "<p>uProxy is being developed by the University of Washington. The project was seeded by Google Ideas and has received contributions from Google, Brave New Software, and the open source community.</p>"
  },
  "WHAT_IS_ALPHA": {
    "description": "",
    "message": "What is an alpha release?"
  },
  "WHAT_IS_ALPHA_ANSWER": {
    "description": "",
    "message": "This alpha version of uProxy is still under development and may be unstable at times; some features are not complete, and there's a <a href=\"https://github.com/uProxy/uproxy/issues\">list of open issues</a> on GitHub. We'd love for you to try it and help us make improvements, by giving us feedback."
  },
  "WHAT_IS_BETA": {
    "description": "",
    "message": "What is a beta release?"
  },
  "WHAT_IS_BETA_ANSWER": {
    "description": "",
    "message": "<p>This beta version of uProxy is still under development, but we believe it should work well for users who have access to at least one of the social networks it supports. We’d love for you to try it, and help us make improvements by giving any feedback you’d like to share. You can post to our public discussion list <a href=\"https://groups.google.com/forum/#!forum/uproxy-discuss\">here</a>, or email us privately at <a href=\"mailto:info@uproxy.org\">info@uproxy.org</a>. If you’re interested in following progress or contributing to the open source project, please see our <a href=\"https://github.com/uProxy/uproxy/issues\">issue tracker on GitHub</a>.</p>"
  },
  "HOW_DO_I_SUBMIT": {
    "description": "",
    "message": "How do I submit feedback?"
  },
  "HOW_DO_I_SUBMIT_ANSWER": {
    "description": "",
    "message": "<p>To submit feedback from within uProxy, go into the menu (≡ icon) and choose “Submit Feedback”. You can also email us at <a href=\"mailto:info@uproxy.org\">info@uproxy.org</a>.</p>"
  },
  "WHAT_ARE_CLOUD_SERVERS": {
    "description": "",
    "message": "What are uProxy cloud servers?"
  },
  "WHAT_ARE_CLOUD_SERVERS_ANSWER": {
    "description": "",
    "message": "<p>uProxy users can get access in two ways: by proxying their traffic through a friend and by connecting to a server that is running uProxy. uProxy can automate the process of creating a private server on a cloud hosting platform. Currently we support DigitalOcean, though manual setup on other servers is possible. Once created, we make it easy to share access to your server with your friends and family—just go to the \"share\" tab.</p>"
  },
  "WHAT_IS_DIGITAL_OCEAN": {
    "description": "",
    "message": "What is DigitalOcean?"
  },
  "WHAT_IS_DIGITAL_OCEAN_ANSWER": {
    "description": "",
    "message": "<p>DigitalOcean is a cloud hosting provider. Once you create an account and set up a payment method, uProxy will be able to create a server under your account. By default, uProxy will set up a server that costs $10 per month. (DigitalOcean offers servers starting at $5/month, and we plan to support these in the future, but for usable performance, the next level up is currently required.) In addition to credit cards, DigitalOcean accepts PayPal, which integrates with a number of payment systems, including UnionPay. You can pause your server or terminate your DigitalOcean account at any time.</p>"
  },
  "HOW_DO_I_INSTALL_UPROXY_ON_SERVER": {
    "description": "",
    "message": "How can I install uProxy on my existing server?"
  },
  "HOW_DO_I_INSTALL_UPROXY_ON_SERVER_ANSWER": {
    "description": "",
    "message": "<p>The uProxy server runs in a Docker container. Advanced users can adapt the instructions in <a href=\"https://blog.uproxy.org/2016/02/get-access-24x7-through-your-own-uproxy.html\">this post</a> to install uProxy on their own servers.</p>"
  },
  "BACK_TO_TOP": {
    "description": "",
    "message": "Back to top"
  },
  "UPROXY_NETWORK_LOGIN_TITLE": {
    "description": "Title for when the user is logging into the uProxy network (via settings or a link)",
    "message": "Sign in to the uProxy network"
  },
  "UPROXY_NETWORK_INVITE_LOGIN_MESSAGE": {
    "description": "Message instructing user to login to the uProxy network to accept an invitation.",
    "message": "To add __name__ as a friend, please sign into the uProxy network"
  },
  "UPROXY_NETWORK_SIGN_IN": {
    "description": "Sign in button for the uProxy network",
    "message": "Sign in"
  },
  "UPROXY_NETWORK_CHOOSE_A_USER_NAME": {
    "description": "Placeholder text for user name on uProxy network",
    "message": "Choose a user name"
  },
  "REQUIRED_FIELD": {
    "description": "Error message indicating that a field is required (e.g. user name)",
    "message": "Required field."
  },
  "GITHUB_LOGIN_CONFIRMATION": {
    "description": "Confirmation message the user sees prior to logging into GitHub",
    "message": "uProxy can use GitHub, a developer tool, to help you connect with your friends.<br><br>Because it may be possible for others to tell which GitHub accounts are using uProxy, <strong>we recommend you create a new anonymous GitHub account</strong>, even if you already use GitHub.  <strong>You will need to verify your email with GitHub before you connect.</strong>"
  },
  "CLOUD_SHARE_INSTRUCTIONS": {
    "description": "Message shown in a dialog, with a Cloud invite code, to let users know how they can allow their friends to proxy through their Cloud instance.",
    "message": "Share access to your cloud instance by sending this link to a friend."
  },
  "SHARE_WITH_A_FRIEND": {
    "description": "Button text shown below each Cloud friend in the Share tab to open a dialog with a Cloud invite code.",
    "message": "Share with a friend"
  },
  "CONNECT_WITH_A_FRIEND": {
    "description": "Title of screen for user to send invites or enter received invites.",
    "message": "Connect with a friend"
  },
  "CHOOSE_A_SOCIAL_NETWORK": {
    "description": "Text prompting user to log into social networks and invite their friends.",
    "message": "Choose a social network"
  },
  "INVITATION_PLACEHOLDER_TEXT": {
    "description": "Invitation placeholder text, instructing users to enter an invite in this field",
    "message": "Have an invitation code?  Enter it here"
  },
  "QUIVER_LOGIN_TEXT": {
    "description": "Text shown to the user when they are about to login to the uProxy Network (aka Quiver)",
    "message": "The uProxy network is a simple way to reliably find and connect to your friends. <uproxy-faq-link anchor='whatIsUproxyNetwork'>Learn more.</uproxy-faq-link>"
  },
  "WHAT_IS_UPROXY_NETWORK": {
    "message": "What is the uProxy Network?"
  },
  "WHAT_IS_UPROXY_NETWORK_ANSWER": {
    "message": "<p>The uProxy network is designed to be one of the simplest ways to reliably connect with your friends, while still being hard to block. To use the uProxy network, you only need to enter a name (which does not have to be unique) and then you're logged in and ready to share invitations with friends. Currently, identity is tied to a single machine; if you want to set up uProxy on a new computer, you will need to reinvite your friends, in order to connect with them from that machine.</p><p>The uProxy team operates the uProxy network, though in the future it will be possible for third-parties to augment the network by running additional server. All information that is sent over the uProxy network is encrypted end-to-end, between peers, so no one can interfere with it. However, network operators can still tell which IP addresses are connecting to each other.</p>"
  },
  "REMOVE_CLOUD_SERVER": {
    "description": "Title for the dialogs that instruct users on deleting a cloud server",
    "message": "Remove cloud server"
  },
  "DESTROY_CLOUD_SERVER_CONFIRMATION": {
    "description": "Message that warns users their cloud server will be destroyed",
    "message": "This will destroy your uProxy cloud server. Please keep in mind that friends and family will no longer be able to use this cloud server once it's destroyed."
  },
  "REMOVE_CLOUD_SERVER_CONFIRMATION": {
    "description": "Message that warns users their cloud server will be destroyed",
    "message": "Are you sure you want to delete this cloud server?"
  },
  "REMOVE_CLOUD_SERVER_SUCCESS": {
    "description": "Message that tells users a cloud server was sucessfully deleted from their friend list",
    "message": "Success! Your cloud server was removed."
  },
  "REMOVE_CLOUD_SERVER_FAILURE": {
    "description": "Message that tells users we failed to destroy their cloud server",
    "message": "We're sorry. We couldn't remove your cloud server for you at this time."
  },
  "DESTROY_CLOUD_SERVER_FAILURE": {
    "description": "Message that tells users we failed to destroy their cloud server",
    "message": "We're sorry. We couldn't destroy your cloud server for you at this time. You may want to log in to the cloud provider to destroy it yourself."
  },
  "CREATE_A_CLOUD_SERVER": {
    "description": "Title on cloud deployment screens, where the user can set up a new server that allows them proxy access.",
    "message": "Create a cloud server"
  },
  "CREATE_A_NEW_ACCOUNT": {
    "description": "Button text for creating a new account (e.g. for DigitalOcean)",
    "message": "Create a DigitalOcean account"
  },
  "SIGN_IN_AND_CONNECT": {
    "description": "Button text for signing into DigitalOcean",
    "message": "Sign in and connect"
  },
  "TRY_AGAIN": {
    "description": "Button text for trying again (e.g. connecting to DigitalOcean)",
    "message": "Try again"
  },
  "CLOUD_INSTALL_SUCCESS_TITLE": {
    "description": "Message shown after successful DigitalOcean server deployment",
    "message": "Success! Your new cloud server is ready."
  },
  "CLOUD_INSTALL_SUCCESS_MESSAGE": {
    "description": "Message shown after successful DigitalOcean server deployment",
    "message": "You can now share access with friends and family from your private server."
  },
  "CLOUD_INSTALL_ERROR_TITLE": {
    "description": "Message shown after failed DigitalOcean server deployment",
    "message": "Oops! We had trouble creating a cloud server."
  },
  "LAUNCH_DIGITAL_OCEAN_SETTINGS": {
    "description": "Button text for launching user's DigitalOcean settings page.",
    "message": "Open DigitalOcean settings"
  },
  "DIGITAL_OCEAN_ERROR_MESSAGE": {
    "description": "Following a failed DigitalOcean install, instruct the user to consult DigitalOcean's website where they can check their settings or remove a half-installed server.",
    "message": "Please check your DigitalOcean settings before trying again. If you don't wish to try again, verify you have no droplets named \"uproxy-cloud-server\". This will ensure you avoid any monthly charges."
  },
  "CLOUD_INSTALL_INSTALLING_TITLE": {
    "description": "Message shown during DigitalOcean server deployment",
    "message": "Hold tight, we're creating a new cloud server."
  },
  "CLOUD_INSTALL_INSTALLING_WARNING": {
    "description": "Message shown during DigitalOcean server deployment.",
    "message": "This process can take up to ten minutes. Please keep the browser open and stay online."
  },
  "CLOUD_INSTALL_INSTALLING_MESSAGE": {
    "description": "Message shown during DigitalOcean server deployment",
    "message": "Once you're connected, you can share access with friends and family from your private server."
  },
  "CLOUD_INSTALL_LOGIN_TITLE": {
    "description": "Message shown during DigitalOcean server deployment",
    "message": "Choose a location near you to create a cloud server."
  },
  "CLOUD_INSTALL_LOGIN_MESSAGE": {
    "description": "Message shown during DigitalOcean server deployment, references text for SIGN_IN_AND_CONNECT button",
    "message": "Once you click \"sign in and connect\", you will be charged $10 a month by DigitalOcean.  You can terminate your server at any time.  <uproxy-faq-link anchor='whatIsDigitalOcean'>Learn more.</uproxy-faq-link>"
  },
  "CLOUD_INSTALL_CREATE_ACCOUNT_TITLE": {
    "description": "Message shown during DigitalOcean server deployment",
    "message": "All you need to get started is your email address and a credit card or paypal account."
  },
  "CLOUD_INSTALL_CREATE_ACCOUNT_MESSAGE": {
    "description": "Message shown during DigitalOcean server deployment, references text for SIGN_ME_IN button",
    "message": "Don't worry about making a new droplet on DigitalOcean, we do that for you.  <uproxy-faq-link anchor='whatIsDigitalOcean'>Learn more.</uproxy-faq-link><br>When you're done creating an account and have updated billing, click \"sign me in.\""
  },
  "CLOUD_INSTALL_GET_STARTED_TITLE": {
    "description": "Message shown during DigitalOcean server deployment",
    "message": "Create a private cloud server on DigitalOcean through uProxy."
  },
  "CLOUD_INSTALL_GET_STARTED_MESSAGE": {
    "description": "Message shown during DigitalOcean server deployment",
    "message": "For $10 per month you can get and share access with your friends and family. If you sign up for DigitalOcean with uProxy, your first month is free! <uproxy-faq-link anchor='whatAreCloudServers'>Learn more.</uproxy-faq-link>"
  },
  "CLOUD_INSTALL_EXISTING_SERVER_TITLE": {
    "description": "Title for 'already have a cloud server' section",
    "message": "Already have a cloud server?"
  },
  "CLOUD_INSTALL_EXISTING_SERVER_MESSAGE": {
    "description": "Instructions link for users who already have an existing cloud server.",
    "message": "You can manually set up your own uProxy server. <uproxy-faq-link anchor='howDoInstallUproxyOnServer'>Learn how</uproxy-faq-link>"
  },
  "CLOUD_INSTALL_INVITE_SCREEN_TITLE": {
    "description": "Message shown on invite screen for DigitalOcean server deployment",
    "message": "Create a cloud server with DigitalOcean"
  },
  "CLOUD_INSTALL_INVITE_SCREEN_MESSAGE": {
    "description": "Message shown on invite screen for DigitalOcean server deployment",
    "message": "Get and share access with friends and family from your own private server."
  },
  "I_HAVE_AN_ACCOUNT": {
    "description": "Button text shown during DigitalOcean server deployment",
    "message": "I have a DigitalOcean account"
  },
  "SIGN_ME_IN": {
    "description": "Button text shown during DigitalOcean server deployment",
    "message": "Sign me in!"
  },
  "EMPTY_ROSTER_INSTRUCTIONS": {
    "description": "Instructions shown when the user has an empty roster",
    "message": "Get and share access from a friend or a private cloud server."
  },
  "ASIA_SINGAPORE": {
    "description": "Region option for deploying a DigitalOcean server",
    "message": "Asia (Singapore)"
  },
  "ASIA_BANGALORE": {
    "description": "Region option for deploying a DigitalOcean server",
    "message": "Asia (Bangalore)"
  },
  "EUROPE_AMSTERDAM": {
    "description": "Region option for deploying a DigitalOcean server",
    "message": "Europe (Amsterdam)"
  },
  "NORTH_AMERICA_NEW_YORK": {
    "description": "Region option for deploying a DigitalOcean server",
    "message": "North America (New York)"
  },
  "REQUEST_ACCESS": {
    "description": "Checkbox text for requesting access as part of invite",
    "message": "Request access"
  },
  "OFFER_ACCESS": {
    "description": "Checkbox text for offering access as part of invite",
    "message": "Offer access"
  },
  "GENERATE_LINK": {
    "description": "Button text, will generate a Quiver invite link when clicked",
    "message": "Generate link"
  },
  "CLOUD_INSTALL_ERROR_EXISTING_SERVER_TITLE": {
    "description": "Message shown after failed server deployment because uproxy-cloud-server already exists",
    "message": "Oops! You already have a uProxy cloud server."
  },
  "CLOUD_INSTALL_ERROR_EXISTING_SERVER_MESSAGE": {
    "description": "Message shown after failed server deployment because uproxy-cloud-server already exists",
    "message": "We discovered that you already have a server named 'uproxy-cloud-server'. We can remove it and create a new one for you, or you can go back to your friend list."
  },
  "REMOVE_SERVER_AND_TRY_AGAIN": {
    "description": "Button text for removing cloud server and trying again (e.g. connecting to DigitalOcean)",
    "message": "Remove server and try again"
  },
  "REMOVING_UPROXY_CLOUD_STATUS": {
    "description": "Label to indicate that we are removing a uproxy cloud server.",
    "message": "Removing uProxy cloud server..."
  },
  "CLOUD_INSTALL_CANCEL_TITLE": {
    "description": "Title shown on overlay when user cancels a cloud server install.",
    "message": "Hold tight! We're canceling the creation of a cloud server."
  },
  "CLOUD_INSTALL_CANCEL_MESSAGE": {
    "description": "Message shown on overlay when user cancels a cloud server install.",
    "message": "Canceling the creation of a cloud server can take up to 2 minutes. Sorry for the wait."
  },
  "CLOUD_INSTALL_CANCEL_SUCCESS": {
    "description": "Message shown on toast when a could server install is completed.",
    "message": "Successfully canceled cloud server creation."
  },
  "CLOUD_INSTALL_CANCEL_FAILURE": {
    "description": "Message shown on toast when a could server install fails.",
    "message": "We cannot cancel the creation of your cloud server right now. You can delete the server once it's ready."
  },
  "RESTART_SERVER_TITLE": {
    "description": "Title shown on dialog when connecting to a server fails.",
    "message": "Oops! We had trouble getting access."
  },
  "RESTART_SERVER_TEXT": {
    "description": "Text shown on dialog when connecting to a server fails.",
    "message": "If you get this error repeatedly, try restarting your server."
  },
  "RESTART_SERVER": {
    "description": "Label for button that confirms user wants to restart a server.",
    "message": "Restart now"
  },
  "RESTARTING_SERVER": {
    "description": "Toast message to confirm that server is restarting.",
    "message": "Restarting server..."
  },
  "RESTART_SUCCESS": {
    "description": "Toast indicating a successful server restart.",
    "message": "Successfully restarted server!"
  },
  "RESTART_FAILURE_TITLE": {
    "description": "Dialog title indicating a failure to restart server.",
    "message": "Uh oh! We could not restart your server."
  },
  "RESTART_FAILURE_TEXT": {
    "description": "Dialog text indicating a failure to restart server.",
    "message": "You may want to delete your cloud server and create a new one."
  },
  "HAVE_PROMO_CODE": {
    "description": "Label for a checkbox indicating that you have a promo code",
    "message": "I have a promo code"
  },
  "AUTHORIZE_DIGITALOCEAN": {
    "message": "Authorize uProxy to connect with DigitalOcean"
  },
  "PROCEED_TO_UPROXY": {
    "message": "Proceed to uProxy"
  },
  "ENTER_PROMO": {
    "message": "Have a promo code? Enter it here."
  },
  "PROMO_ACCEPTED": {
    "message": "Promo code accepted!"
  },
  "PROMO_FAILED": {
    "message": "Could not apply promo code."
  },
  "PROCESSING": {
    "message": "processing..."
  },
  "APPLY": {
    "message": "Apply"
  }
}
